#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announcement_Basic

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Announcement_Basic.Announcement_Basic_C
// 0x0028 (0x0268 - 0x0240)
class UAnnouncement_Basic_C final : public UFortAnnouncementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBoxRoot;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     TextDetailText;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextTitleText;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Announcement_Basic(int32 EntryPoint);
	void AnnouncementStopped(class AFortClientAnnouncement* Announcement);
	void Construct();
	void UpdateWidgetData(class AFortClientAnnouncement* Announcement);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Announcement_Basic_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Announcement_Basic_C")
	}
	static class UAnnouncement_Basic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnnouncement_Basic_C>();
	}
};
DUMPER7_ASSERTS_UAnnouncement_Basic_C;

}

