#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_HexsylvaniaCine

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Announce_HexsylvaniaCine.Announce_HexsylvaniaCine_C
// 0x0028 (0x0420 - 0x03F8)
class AAnnounce_HexsylvaniaCine_C final : public AFortClientAnnouncement_Cinematic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           HexylvaniaMediaSource;                             // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowSkipping;                                     // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortUIState                                  StartingState;                                     // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMediaSubtitlesPlayer*              HexylvaniaSubtitlesPlayer;                         // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Announce_HexsylvaniaCine(int32 EntryPoint);
	void HandleAllowSkip();
	void HandleClientEvent_CinematicFinishedPlaying(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void OnPlayerSkippedCutscene();
	void OnClientAnnouncementStop();
	void OnClientAnnouncementStart();
	void OnStateEntered_FE03E71B4E723372BF2F0F96EC45C24B();
	void OnStateEntered_9C83DA6340C5A54C51BA50B49786F065();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Announce_HexsylvaniaCine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Announce_HexsylvaniaCine_C")
	}
	static class AAnnounce_HexsylvaniaCine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAnnounce_HexsylvaniaCine_C>();
	}
};
DUMPER7_ASSERTS_AAnnounce_HexsylvaniaCine_C;

}

