#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_TutorialConversation

#include "Basic.hpp"

#include "TutorialHighlightData_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Announce_TutorialConversation.Announce_TutorialConversation_C.ExecuteUbergraph_Announce_TutorialConversation
// 0x0250 (0x0250 - 0x0000)
struct Announce_TutorialConversation_C_ExecuteUbergraph_Announce_TutorialConversation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayConversation_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortConversationSentence              K2Node_Event_FinishingSentence;                    // 0x0008(0x00B0)()
	int32                                         K2Node_Event_FinishingSentenceSentenceIndex;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortConversationSentence              K2Node_Event_Sentence2;                            // 0x00C0(0x00B0)(ConstParm)
	int32                                         K2Node_Event_SentenceIndex2;                       // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTutorialHighlightData                 CallFunc_Array_Get_Item;                           // 0x0178(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortConversationSentence              K2Node_Event_Sentence;                             // 0x0190(0x00B0)(ConstParm)
	int32                                         K2Node_Event_SentenceIndex;                        // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayConversationFromSentenceIndex_ReturnValue; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Announce_TutorialConversation_C_ExecuteUbergraph_Announce_TutorialConversation;

// Function Announce_TutorialConversation.Announce_TutorialConversation_C.OnSentenceFinished
// 0x00B8 (0x00B8 - 0x0000)
struct Announce_TutorialConversation_C_OnSentenceFinished final
{
public:
	struct FFortConversationSentence              Sentence;                                          // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm)
	int32                                         SentenceIndex;                                     // 0x00B0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Announce_TutorialConversation_C_OnSentenceFinished;

// Function Announce_TutorialConversation.Announce_TutorialConversation_C.OnConversationFinished
// 0x00B8 (0x00B8 - 0x0000)
struct Announce_TutorialConversation_C_OnConversationFinished final
{
public:
	struct FFortConversationSentence              FinishingSentence;                                 // 0x0000(0x00B0)(Parm)
	int32                                         FinishingSentenceSentenceIndex;                    // 0x00B0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Announce_TutorialConversation_C_OnConversationFinished;

// Function Announce_TutorialConversation.Announce_TutorialConversation_C.OnSentenceStarted
// 0x00B8 (0x00B8 - 0x0000)
struct Announce_TutorialConversation_C_OnSentenceStarted final
{
public:
	struct FFortConversationSentence              Sentence;                                          // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm)
	int32                                         SentenceIndex;                                     // 0x00B0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Announce_TutorialConversation_C_OnSentenceStarted;

// Function Announce_TutorialConversation.Announce_TutorialConversation_C.HandleSentenceStart_UI
// 0x0004 (0x0004 - 0x0000)
struct Announce_TutorialConversation_C_HandleSentenceStart_UI final
{
public:
	int32                                         SentenceIdx;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Announce_TutorialConversation_C_HandleSentenceStart_UI;

// Function Announce_TutorialConversation.Announce_TutorialConversation_C.HandleSentenceStop_UI
// 0x0004 (0x0004 - 0x0000)
struct Announce_TutorialConversation_C_HandleSentenceStop_UI final
{
public:
	int32                                         SentenceIdx;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Announce_TutorialConversation_C_HandleSentenceStop_UI;

}

