#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberDBNOState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTeamMemberDBNOState.AthenaTeamMemberDBNOState_C
// 0x0020 (0x0250 - 0x0230)
class UAthenaTeamMemberDBNOState_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 DBNOIndicator;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTimer;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              Visibility_When_Not_DBNO;                          // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReviveTimeMax;                                     // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaTeamMemberDBNOState(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_DBNO(bool Is_DBNO);
	void Set_Reviving(bool Is_Reviving);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaTeamMemberDBNOState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaTeamMemberDBNOState_C")
	}
	static class UAthenaTeamMemberDBNOState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamMemberDBNOState_C>();
	}
};
DUMPER7_ASSERTS_UAthenaTeamMemberDBNOState_C;

}

