#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaRotator.AthenaRotator_C
// 0x0038 (0x0968 - 0x0930)
class UAthenaRotator_C final : public UCommonRotator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0930(0x0008)(Transient, DuplicateTransient)
	struct FDataTableRowHandle                    Left_Triggering_Input_Action;                      // 0x0938(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableRowHandle                    Right_Triggering_Input_Action;                     // 0x0948(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class UClass*                                 TextStyle;                                         // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowGamepadButtonOnlyWhenFocused;                  // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaRotator(int32 EntryPoint);
	void OnClicked();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void ChangeDirection(bool bDirection);
	void NewFunction_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaRotator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaRotator_C")
	}
	static class UAthenaRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaRotator_C>();
	}
};
DUMPER7_ASSERTS_UAthenaRotator_C;

}

