#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberIndicator

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.ExecuteUbergraph_AthenaTeamMemberIndicator
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<bool>& DBNOStates)> K2Node_CreateDelegate_OutputDelegate;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	TDelegate<void(const TArray<bool>& RevivingStates)> K2Node_CreateDelegate_OutputDelegate2;       // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0048(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetCurrentPawn_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<bool>& TalkingStates)> K2Node_CreateDelegate_OutputDelegate4;        // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator;

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct AthenaTeamMemberIndicator_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AthenaTeamMemberIndicator_C_Tick;

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.On Team DBNO Changed
// 0x0018 (0x0018 - 0x0000)
struct AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed final
{
public:
	TArray<bool>                                  DBNOStates;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed;

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.On Team Reviving Changed
// 0x0018 (0x0018 - 0x0000)
struct AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed final
{
public:
	TArray<bool>                                  Team_Reviving;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed;

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.On Team Talking Changed
// 0x0020 (0x0020 - 0x0000)
struct AthenaTeamMemberIndicator_C_On_Team_Talking_Changed final
{
public:
	TArray<bool>                                  Team_Talking;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AthenaTeamMemberIndicator_C_On_Team_Talking_Changed;

}

