#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "CommonUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CommonUI.CommonTextBlock.SetProperties
// 0x0010 (0x0010 - 0x0000)
struct CommonTextBlock_SetProperties final
{
public:
	TSubclassOf<class UCommonTextStyle>           InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonTextScrollStyle>     InScrollStyle;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTextBlock_SetProperties;

// Function CommonUI.CommonTextBlock.SetScrollStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonTextBlock_SetScrollStyle final
{
public:
	TSubclassOf<class UCommonTextScrollStyle>     InScrollStyle;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTextBlock_SetScrollStyle;

// Function CommonUI.CommonTextBlock.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonTextBlock_SetStyle final
{
public:
	TSubclassOf<class UCommonTextStyle>           InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTextBlock_SetStyle;

// Function CommonUI.CommonTextBlock.SetWrapTextWidth
// 0x0004 (0x0004 - 0x0000)
struct CommonTextBlock_SetWrapTextWidth final
{
public:
	int32                                         InWrapTextAt;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTextBlock_SetWrapTextWidth;

// Function CommonUI.CommonNumericTextBlock.InterpolateToValue
// 0x0010 (0x0010 - 0x0000)
struct CommonNumericTextBlock_InterpolateToValue final
{
public:
	float                                         TargetValue;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumInterpolationDuration;                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumChangeRate;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutroOffset;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonNumericTextBlock_InterpolateToValue;

// Function CommonUI.CommonNumericTextBlock.SetCurrentValue
// 0x0004 (0x0004 - 0x0000)
struct CommonNumericTextBlock_SetCurrentValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonNumericTextBlock_SetCurrentValue;

// Function CommonUI.CommonNumericTextBlock.GetTargetValue
// 0x0004 (0x0004 - 0x0000)
struct CommonNumericTextBlock_GetTargetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonNumericTextBlock_GetTargetValue;

// Function CommonUI.CommonNumericTextBlock.IsInterpolatingNumericValue
// 0x0001 (0x0001 - 0x0000)
struct CommonNumericTextBlock_IsInterpolatingNumericValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonNumericTextBlock_IsInterpolatingNumericValue;

// Function CommonUI.CommonUserWidget.SetConsumePointerInput
// 0x0001 (0x0001 - 0x0000)
struct CommonUserWidget_SetConsumePointerInput final
{
public:
	bool                                          bInConsumePointerInput;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonUserWidget_SetConsumePointerInput;

// Function CommonUI.CommonActionWidget.SetInputAction
// 0x0010 (0x0010 - 0x0000)
struct CommonActionWidget_SetInputAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActionWidget_SetInputAction;

// Function CommonUI.CommonActionWidget.GetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct CommonActionWidget_GetDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActionWidget_GetDisplayText;

// Function CommonUI.CommonActionWidget.GetIcon
// 0x0090 (0x0090 - 0x0000)
struct CommonActionWidget_GetIcon final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActionWidget_GetIcon;

// Function CommonUI.CommonActionWidget.IsHeldAction
// 0x0001 (0x0001 - 0x0000)
struct CommonActionWidget_IsHeldAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActionWidget_IsHeldAction;

// Function CommonUI.CommonTabListWidget.DisableTabWithReason
// 0x0020 (0x0020 - 0x0000)
struct CommonTabListWidget_DisableTabWithReason final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Reason;                                            // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_DisableTabWithReason;

// Function CommonUI.CommonTabListWidget.GetTabButtonByID
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_GetTabButtonByID final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButton*                          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_GetTabButtonByID;

// Function CommonUI.CommonTabListWidget.HandleNextTabInputAction
// 0x0001 (0x0001 - 0x0000)
struct CommonTabListWidget_HandleNextTabInputAction final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_HandleNextTabInputAction;

// Function CommonUI.CommonTabListWidget.HandlePreviousTabInputAction
// 0x0001 (0x0001 - 0x0000)
struct CommonTabListWidget_HandlePreviousTabInputAction final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_HandlePreviousTabInputAction;

// Function CommonUI.CommonTabListWidget.HandleTabButtonSelected
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_HandleTabButtonSelected final
{
public:
	class UCommonButton*                          SelectedTabButton;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonTabListWidget_HandleTabButtonSelected;

// Function CommonUI.CommonTabListWidget.HandleTabCreated
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_HandleTabCreated final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_HandleTabCreated;

// Function CommonUI.CommonTabListWidget.HandleTabRemoved
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_HandleTabRemoved final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_HandleTabRemoved;

// Function CommonUI.CommonTabListWidget.RegisterTab
// 0x0020 (0x0020 - 0x0000)
struct CommonTabListWidget_RegisterTab final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButton>              ButtonWidgetType;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ContentWidget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonTabListWidget_RegisterTab;

// Function CommonUI.CommonTabListWidget.RemoveTab
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_RemoveTab final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonTabListWidget_RemoveTab;

// Function CommonUI.CommonTabListWidget.SelectTabByID
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_SelectTabByID final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuppressClickFeedback;                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonTabListWidget_SelectTabByID;

// Function CommonUI.CommonTabListWidget.SetLinkedSwitcher
// 0x0008 (0x0008 - 0x0000)
struct CommonTabListWidget_SetLinkedSwitcher final
{
public:
	class UCommonWidgetSwitcher*                  CommonSwitcher;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_SetLinkedSwitcher;

// Function CommonUI.CommonTabListWidget.SetListeningForInput
// 0x0001 (0x0001 - 0x0000)
struct CommonTabListWidget_SetListeningForInput final
{
public:
	bool                                          bShouldListen;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_SetListeningForInput;

// Function CommonUI.CommonTabListWidget.SetTabEnabled
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_SetTabEnabled final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonTabListWidget_SetTabEnabled;

// Function CommonUI.CommonTabListWidget.SetTabVisibility
// 0x0010 (0x0010 - 0x0000)
struct CommonTabListWidget_SetTabVisibility final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              NewVisibility;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonTabListWidget_SetTabVisibility;

// Function CommonUI.CommonTabListWidget.GetActiveTab
// 0x0008 (0x0008 - 0x0000)
struct CommonTabListWidget_GetActiveTab final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_GetActiveTab;

// Function CommonUI.CommonTabListWidget.GetLinkedSwitcher
// 0x0008 (0x0008 - 0x0000)
struct CommonTabListWidget_GetLinkedSwitcher final
{
public:
	class UCommonWidgetSwitcher*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_GetLinkedSwitcher;

// Function CommonUI.CommonTabListWidget.GetTabCount
// 0x0004 (0x0004 - 0x0000)
struct CommonTabListWidget_GetTabCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTabListWidget_GetTabCount;

// Function CommonUI.CommonActivatablePanel.AddInputActionHandler
// 0x0020 (0x0020 - 0x0000)
struct CommonActivatablePanel_AddInputActionHandler final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_AddInputActionHandler;

// Function CommonUI.CommonActivatablePanel.AddInputActionHandlerWithProgress
// 0x0030 (0x0030 - 0x0000)
struct CommonActivatablePanel_AddInputActionHandlerWithProgress final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float HeldPercent)>            ProgressEvent;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_AddInputActionHandlerWithProgress;

// Function CommonUI.CommonActivatablePanel.AddInputActionNoHandler
// 0x0010 (0x0010 - 0x0000)
struct CommonActivatablePanel_AddInputActionNoHandler final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_AddInputActionNoHandler;

// Function CommonUI.CommonActivatablePanel.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatablePanel_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_OnInputModeChanged;

// Function CommonUI.CommonActivatablePanel.RemoveInputActionHandler
// 0x0010 (0x0010 - 0x0000)
struct CommonActivatablePanel_RemoveInputActionHandler final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_RemoveInputActionHandler;

// Function CommonUI.CommonActivatablePanel.SetActionHandlerState
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerState final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonActivatablePanel_SetActionHandlerState;

// Function CommonUI.CommonActivatablePanel.SetActionHandlerStateFromHandle
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerStateFromHandle final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonActivatablePanel_SetActionHandlerStateFromHandle;

// Function CommonUI.CommonActivatablePanel.SetActionHandlerStateFromHandleWithDisabledCommitEvent
// 0x0028 (0x0028 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           DisabledCommitEvent;                               // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_SetActionHandlerStateFromHandleWithDisabledCommitEvent;

// Function CommonUI.CommonActivatablePanel.SetActionHandlerStateWithDisabledCommitEvent
// 0x0028 (0x0028 - 0x0000)
struct CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionState                             State;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           DisabledCommitEvent;                               // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_SetActionHandlerStateWithDisabledCommitEvent;

// Function CommonUI.CommonActivatablePanel.SetInputActionHandler
// 0x0020 (0x0020 - 0x0000)
struct CommonActivatablePanel_SetInputActionHandler final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_SetInputActionHandler;

// Function CommonUI.CommonActivatablePanel.SetInputActionHandlerWithProgress
// 0x0030 (0x0030 - 0x0000)
struct CommonActivatablePanel_SetInputActionHandlerWithProgress final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool* bPassThrough)>           CommitedEvent;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float HeldPercent)>            ProgressEvent;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_SetInputActionHandlerWithProgress;

// Function CommonUI.CommonActivatablePanel.GetInputActions
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_GetInputActions final
{
public:
	TArray<struct FCommonInputActionHandlerData>  InputActionDataRows;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonActivatablePanel_GetInputActions;

// Function CommonUI.CommonActivatablePanel.HasInputActionHandler
// 0x0018 (0x0018 - 0x0000)
struct CommonActivatablePanel_HasInputActionHandler final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonActivatablePanel_HasInputActionHandler;

// Function CommonUI.CommonActivatablePanel.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatablePanel_IsActivated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_IsActivated;

// Function CommonUI.CommonActivatablePanel.IsIntroed
// 0x0001 (0x0001 - 0x0000)
struct CommonActivatablePanel_IsIntroed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonActivatablePanel_IsIntroed;

// Function CommonUI.CommonButton.DisableButtonWithReason
// 0x0018 (0x0018 - 0x0000)
struct CommonButton_DisableButtonWithReason final
{
public:
	class FText                                   DisabledReason;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_DisableButtonWithReason;

// Function CommonUI.CommonButton.HandleTriggeringActionCommited
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_HandleTriggeringActionCommited final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_HandleTriggeringActionCommited;

// Function CommonUI.CommonButton.NativeOnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct CommonButton_NativeOnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_NativeOnActionProgress;

// Function CommonUI.CommonButton.OnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct CommonButton_OnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_OnActionProgress;

// Function CommonUI.CommonButton.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_OnInputMethodChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_OnInputMethodChanged;

// Function CommonUI.CommonButton.OnTriggeredInputActionChanged
// 0x0010 (0x0010 - 0x0000)
struct CommonButton_OnTriggeredInputActionChanged final
{
public:
	struct FDataTableRowHandle                    NewTriggeredAction;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_OnTriggeredInputActionChanged;

// Function CommonUI.CommonButton.SetInputActionProgressMaterial
// 0x0098 (0x0098 - 0x0000)
struct CommonButton_SetInputActionProgressMaterial final
{
public:
	struct FSlateBrush                            InProgressMaterialBrush;                           // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InProgressMaterialParam;                           // 0x0090(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetInputActionProgressMaterial;

// Function CommonUI.CommonButton.SetIsInteractionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_SetIsInteractionEnabled final
{
public:
	bool                                          bInIsInteractionEnabled;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetIsInteractionEnabled;

// Function CommonUI.CommonButton.SetIsSelectable
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_SetIsSelectable final
{
public:
	bool                                          bInIsSelectable;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetIsSelectable;

// Function CommonUI.CommonButton.SetIsSelected
// 0x0002 (0x0002 - 0x0000)
struct CommonButton_SetIsSelected final
{
public:
	bool                                          InSelected;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGiveClickFeedback;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetIsSelected;

// Function CommonUI.CommonButton.SetIsToggleable
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_SetIsToggleable final
{
public:
	bool                                          bInIsToggleable;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetIsToggleable;

// Function CommonUI.CommonButton.SetMinDimensions
// 0x0008 (0x0008 - 0x0000)
struct CommonButton_SetMinDimensions final
{
public:
	int32                                         InMinWidth;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMinHeight;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetMinDimensions;

// Function CommonUI.CommonButton.SetSelectedInternal
// 0x0003 (0x0003 - 0x0000)
struct CommonButton_SetSelectedInternal final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSound;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBroadcast;                                        // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetSelectedInternal;

// Function CommonUI.CommonButton.SetShouldSelectUponReceivingFocus
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_SetShouldSelectUponReceivingFocus final
{
public:
	bool                                          bInShouldSelectUponReceivingFocus;                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetShouldSelectUponReceivingFocus;

// Function CommonUI.CommonButton.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButton_SetStyle final
{
public:
	TSubclassOf<class UCommonButtonStyle>         InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetStyle;

// Function CommonUI.CommonButton.SetTriggeredInputAction
// 0x0018 (0x0018 - 0x0000)
struct CommonButton_SetTriggeredInputAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UCommonActivatablePanel*                OldPanel;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_SetTriggeredInputAction;

// Function CommonUI.CommonButton.GetCurrentButtonPadding
// 0x0010 (0x0010 - 0x0000)
struct CommonButton_GetCurrentButtonPadding final
{
public:
	struct FMargin                                OutButtonPadding;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetCurrentButtonPadding;

// Function CommonUI.CommonButton.GetCurrentCustomPadding
// 0x0010 (0x0010 - 0x0000)
struct CommonButton_GetCurrentCustomPadding final
{
public:
	struct FMargin                                OutCustomPadding;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetCurrentCustomPadding;

// Function CommonUI.CommonButton.GetCurrentTextStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButton_GetCurrentTextStyle final
{
public:
	class UCommonTextStyle*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetCurrentTextStyle;

// Function CommonUI.CommonButton.GetCurrentTextStyleClass
// 0x0008 (0x0008 - 0x0000)
struct CommonButton_GetCurrentTextStyleClass final
{
public:
	TSubclassOf<class UCommonTextStyle>           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetCurrentTextStyleClass;

// Function CommonUI.CommonButton.GetInputAction
// 0x0018 (0x0018 - 0x0000)
struct CommonButton_GetInputAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonButton_GetInputAction;

// Function CommonUI.CommonButton.GetSelected
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_GetSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetSelected;

// Function CommonUI.CommonButton.GetShouldSelectUponReceivingFocus
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_GetShouldSelectUponReceivingFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetShouldSelectUponReceivingFocus;

// Function CommonUI.CommonButton.GetSingleMaterialStyleMID
// 0x0008 (0x0008 - 0x0000)
struct CommonButton_GetSingleMaterialStyleMID final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetSingleMaterialStyleMID;

// Function CommonUI.CommonButton.GetStyle
// 0x0008 (0x0008 - 0x0000)
struct CommonButton_GetStyle final
{
public:
	class UCommonButtonStyle*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_GetStyle;

// Function CommonUI.CommonButton.IsHovered
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_IsHovered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_IsHovered;

// Function CommonUI.CommonButton.IsInteractionEnabled
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_IsInteractionEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_IsInteractionEnabled;

// Function CommonUI.CommonButton.IsPressed
// 0x0001 (0x0001 - 0x0000)
struct CommonButton_IsPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButton_IsPressed;

// Function CommonUI.CommonListView.DynamicHandleItemClickedCommonButton
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_DynamicHandleItemClickedCommonButton final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_DynamicHandleItemClickedCommonButton;

// Function CommonUI.CommonListView.DynamicHandleItemClickedUserWidget
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_DynamicHandleItemClickedUserWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_DynamicHandleItemClickedUserWidget;

// Function CommonUI.CommonListView.DynamicHandleItemDoubleClickedCommonButton
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_DynamicHandleItemDoubleClickedCommonButton final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_DynamicHandleItemDoubleClickedCommonButton;

// Function CommonUI.CommonListView.DynamicHandleItemHoveredCommonButton
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_DynamicHandleItemHoveredCommonButton final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_DynamicHandleItemHoveredCommonButton;

// Function CommonUI.CommonListView.DynamicHandleItemUnhoveredCommonButton
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_DynamicHandleItemUnhoveredCommonButton final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_DynamicHandleItemUnhoveredCommonButton;

// Function CommonUI.CommonListView.ScrollIntoView
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_ScrollIntoView final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NavigateOnScrollIntoView;                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonListView_ScrollIntoView;

// Function CommonUI.CommonListView.SetDataProvider
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_SetDataProvider final
{
public:
	TArray<class UObject*>                        InDataProvider;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_SetDataProvider;

// Function CommonUI.CommonListView.SetDesiredItemPadding
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_SetDesiredItemPadding final
{
public:
	struct FMargin                                DesiredPadding;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_SetDesiredItemPadding;

// Function CommonUI.CommonListView.SetItemHeight
// 0x0004 (0x0004 - 0x0000)
struct CommonListView_SetItemHeight final
{
public:
	float                                         NewHeight;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_SetItemHeight;

// Function CommonUI.CommonListView.SetItemSelection
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_SetItemSelection final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonListView_SetItemSelection;

// Function CommonUI.CommonListView.SetSelectedIndex
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_SetSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonListView_SetSelectedIndex;

// Function CommonUI.CommonListView.SetSelectedItem
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_SetSelectedItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitIfPendingRefresh;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonListView_SetSelectedItem;

// Function CommonUI.CommonListView.SetSelectionMode
// 0x0001 (0x0001 - 0x0000)
struct CommonListView_SetSelectionMode final
{
public:
	ESelectionMode                                SelectionMode_0;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_SetSelectionMode;

// Function CommonUI.CommonListView.SetSimulateDoubleClickOnSelectedItemClick
// 0x0001 (0x0001 - 0x0000)
struct CommonListView_SetSimulateDoubleClickOnSelectedItemClick final
{
public:
	bool                                          bInSimulateDoubleClick;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_SetSimulateDoubleClickOnSelectedItemClick;

// Function CommonUI.CommonListView.AddItem
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_AddItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_AddItem;

// Function CommonUI.CommonListView.GetIndexForItem
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_GetIndexForItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonListView_GetIndexForItem;

// Function CommonUI.CommonListView.GetItemAt
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_GetItemAt final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_GetItemAt;

// Function CommonUI.CommonListView.GetNumItems
// 0x0004 (0x0004 - 0x0000)
struct CommonListView_GetNumItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_GetNumItems;

// Function CommonUI.CommonListView.GetNumItemsSelected
// 0x0004 (0x0004 - 0x0000)
struct CommonListView_GetNumItemsSelected final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_GetNumItemsSelected;

// Function CommonUI.CommonListView.GetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct CommonListView_GetSelectedItem final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_GetSelectedItem;

// Function CommonUI.CommonListView.GetSelectedItems
// 0x0018 (0x0018 - 0x0000)
struct CommonListView_GetSelectedItems final
{
public:
	TArray<class UObject*>                        Items;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonListView_GetSelectedItems;

// Function CommonUI.CommonListView.GetSelectionModeBP
// 0x0001 (0x0001 - 0x0000)
struct CommonListView_GetSelectionModeBP final
{
public:
	ESelectionMode                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_GetSelectionModeBP;

// Function CommonUI.CommonListView.IsItemVisible
// 0x0010 (0x0010 - 0x0000)
struct CommonListView_IsItemVisible final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonListView_IsItemVisible;

// Function CommonUI.CommonListView.IsRefreshPending
// 0x0001 (0x0001 - 0x0000)
struct CommonListView_IsRefreshPending final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonListView_IsRefreshPending;

// Function CommonUI.CommonWidgetGroupBase.AddWidget
// 0x0008 (0x0008 - 0x0000)
struct CommonWidgetGroupBase_AddWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonWidgetGroupBase_AddWidget;

// Function CommonUI.CommonWidgetGroupBase.RemoveWidget
// 0x0008 (0x0008 - 0x0000)
struct CommonWidgetGroupBase_RemoveWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonWidgetGroupBase_RemoveWidget;

// Function CommonUI.CommonTileView.SetItemWidth
// 0x0004 (0x0004 - 0x0000)
struct CommonTileView_SetItemWidth final
{
public:
	float                                         NewWidth;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonTileView_SetItemWidth;

// Function CommonUI.CommonButtonGroup.OnButtonHovered
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonGroup_OnButtonHovered final
{
public:
	class UCommonButton*                          BaseButton;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButtonGroup_OnButtonHovered;

// Function CommonUI.CommonButtonGroup.OnButtonUnhovered
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonGroup_OnButtonUnhovered final
{
public:
	class UCommonButton*                          BaseButton;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButtonGroup_OnButtonUnhovered;

// Function CommonUI.CommonButtonGroup.OnHandleButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonGroup_OnHandleButtonClicked final
{
public:
	class UCommonButton*                          BaseButton;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButtonGroup_OnHandleButtonClicked;

// Function CommonUI.CommonButtonGroup.OnHandleButtonDoubleClicked
// 0x0008 (0x0008 - 0x0000)
struct CommonButtonGroup_OnHandleButtonDoubleClicked final
{
public:
	class UCommonButton*                          BaseButton;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonButtonGroup_OnHandleButtonDoubleClicked;

// Function CommonUI.CommonButtonGroup.OnSelectionStateChanged
// 0x0010 (0x0010 - 0x0000)
struct CommonButtonGroup_OnSelectionStateChanged final
{
public:
