#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_BLK_Red_Head_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_BLK_Red_Head_01_Skeleton_AnimBP.F_MED_BLK_Red_Head_01_Skeleton_AnimBP_C
// 0x04A8 (0x08B8 - 0x0410)
class UF_MED_BLK_Red_Head_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_ADD84ECA4C179A894077EA926E4E8C27; // 0x0418(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_D97E649D45B817241D9AEC8AFF8B1030; // 0x0460(0x0098)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14C43EE54D79827F00DF1E9A8242ED73; // 0x04F8(0x0060)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_26AEFC2749B6D18C132B8A9AFACB7107; // 0x0558(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_B3EB7DD7487D3DA8C89669A6B3EE960E; // 0x0608(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_CF536D774F38E2EEF45328867E530E1F; // 0x06B8(0x00D0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_3C3D052A4A90851006AF169ADEDB9A0D; // 0x0788(0x0098)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9E42BD2C4D12D2F1E124EFBCD05D9810; // 0x0820(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1E99F95C4ECF47136D41C482F786FD2C; // 0x0868(0x0048)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_MED_BLK_Red_Head_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_BLK_Red_Head_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_D97E649D45B817241D9AEC8AFF8B1030();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_BLK_Red_Head_01_Skeleton_AnimBP_AnimGraphNode_BlendListByBool_CF536D774F38E2EEF45328867E530E1F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_BLK_Red_Head_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_3C3D052A4A90851006AF169ADEDB9A0D();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("F_MED_BLK_Red_Head_01_Skeleton_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"F_MED_BLK_Red_Head_01_Skeleton_AnimBP_C")
	}
	static class UF_MED_BLK_Red_Head_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_BLK_Red_Head_01_Skeleton_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UF_MED_BLK_Red_Head_01_Skeleton_AnimBP_C;

}

