#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Party_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function FortniteUI.FortItemWidget_NUI.SetItemToRepresent
// 0x0008 (0x0008 - 0x0000)
struct FortItemWidget_NUI_SetItemToRepresent final
{
public:
	const class UFortItem*                        ItemToRepresent_0;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemWidget_NUI_SetItemToRepresent;

// Function FortniteUI.FortItemWidget_NUI.SetItemViewContext
// 0x0010 (0x0010 - 0x0000)
struct FortItemWidget_NUI_SetItemViewContext final
{
public:
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext_0;                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemWidget_NUI_SetItemViewContext;

// Function FortniteUI.UINavigationManager.GetDisplayName
// 0x0020 (0x0020 - 0x0000)
struct UINavigationManager_GetDisplayName final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UINavigationManager_GetDisplayName;

// Function FortniteUI.UINavigationManager.GetStackSize
// 0x0004 (0x0004 - 0x0000)
struct UINavigationManager_GetStackSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UINavigationManager_GetStackSize;

// Function FortniteUI.UINavigationManager.NavigationToIndex
// 0x0004 (0x0004 - 0x0000)
struct UINavigationManager_NavigationToIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UINavigationManager_NavigationToIndex;

// Function FortniteUI.UINavigationManager.PushNavigation
// 0x0050 (0x0050 - 0x0000)
struct UINavigationManager_PushNavigation final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class UObject*                                ObjectData;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IdData;                                            // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntData;                                           // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUINavigationData& Data)> OnNavigateTo;                              // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FUINavigationData& Data)> OnNavigateFrom;                            // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UINavigationManager_PushNavigation;

// Function FortniteUI.FortUINavigationManager.AttemptMatchmakeForQuest
// 0x0010 (0x0010 - 0x0000)
struct FortUINavigationManager_AttemptMatchmakeForQuest final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutContentNotDownloaded;                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUINavigationManager_AttemptMatchmakeForQuest;

// Function FortniteUI.FortUINavigationManager.AttemptPlayQuest
// 0x0008 (0x0008 - 0x0000)
struct FortUINavigationManager_AttemptPlayQuest final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_AttemptPlayQuest;

// Function FortniteUI.FortUINavigationManager.CanNavigateToQuestObjective
// 0x0010 (0x0010 - 0x0000)
struct FortUINavigationManager_CanNavigateToQuestObjective final
{
public:
	class UFortQuestItem*                         QuestItem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUINavigationManager_CanNavigateToQuestObjective;

// Function FortniteUI.FortUINavigationManager.CenterWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUINavigationManager_CenterWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_CenterWidget;

// Function FortniteUI.FortUINavigationManager.CompletePendingNavigationOp
// 0x0001 (0x0001 - 0x0000)
struct FortUINavigationManager_CompletePendingNavigationOp final
{
public:
	EFortUINavigationOp                           NavigationOp;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_CompletePendingNavigationOp;

// Function FortniteUI.FortUINavigationManager.HasPendingNavigationOp
// 0x0002 (0x0002 - 0x0000)
struct FortUINavigationManager_HasPendingNavigationOp final
{
public:
	EFortUINavigationOp                           NavigationOp;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_HasPendingNavigationOp;

// Function FortniteUI.FortUINavigationManager.NavigateToFeature
// 0x0001 (0x0001 - 0x0000)
struct FortUINavigationManager_NavigateToFeature final
{
public:
	EFortUIFeature                                Feature;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_NavigateToFeature;

// Function FortniteUI.FortUINavigationManager.NavigateToItem
// 0x0008 (0x0008 - 0x0000)
struct FortUINavigationManager_NavigateToItem final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_NavigateToItem;

// Function FortniteUI.FortUINavigationManager.NavigateToItemManagementScreen
// 0x0001 (0x0001 - 0x0000)
struct FortUINavigationManager_NavigateToItemManagementScreen final
{
public:
	EFortFrontendInventoryFilter                  Filter;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_NavigateToItemManagementScreen;

// Function FortniteUI.FortUINavigationManager.NavigateToNodePage
// 0x0010 (0x0010 - 0x0000)
struct FortUINavigationManager_NavigateToNodePage final
{
public:
	class FName                                   PageId;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NodeID;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_NavigateToNodePage;

// Function FortniteUI.FortUINavigationManager.NavigateToNodePageByGameplayTagContainer
// 0x0020 (0x0020 - 0x0000)
struct FortUINavigationManager_NavigateToNodePageByGameplayTagContainer final
{
public:
	struct FGameplayTagContainer                  GameplayTagContainer;                              // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_NavigateToNodePageByGameplayTagContainer;

// Function FortniteUI.FortUINavigationManager.NavigateToQuestObjective
// 0x0008 (0x0008 - 0x0000)
struct FortUINavigationManager_NavigateToQuestObjective final
{
public:
	class UFortQuestItem*                         QuestItem;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_NavigateToQuestObjective;

// Function FortniteUI.FortUINavigationManager.NavigateToSquadSlot
// 0x0010 (0x0010 - 0x0000)
struct FortUINavigationManager_NavigateToSquadSlot final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SquadSlotIndex;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUINavigationManager_NavigateToSquadSlot;

// Function FortniteUI.FortUINavigationManager.PushItemInspectionScreen
// 0x0010 (0x0010 - 0x0000)
struct FortUINavigationManager_PushItemInspectionScreen final
{
public:
	class UFortItem*                              ItemToInspect;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortItemInspectionMode                       Mode;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReadOnly;                                         // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowFavoriting;                                  // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTemporaryItem;                                  // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUINavigationManager_PushItemInspectionScreen;

// Function FortniteUI.FortUINavigationManager.PushItemManagementScreen
// 0x0001 (0x0001 - 0x0000)
struct FortUINavigationManager_PushItemManagementScreen final
{
public:
	EFortFrontendInventoryFilter                  ItemManagementFilter;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_PushItemManagementScreen;

// Function FortniteUI.FortUINavigationManager.PushSkillTreeNode
// 0x0008 (0x0008 - 0x0000)
struct FortUINavigationManager_PushSkillTreeNode final
{
public:
	class FName                                   SkillTreeNodeId;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_PushSkillTreeNode;

// Function FortniteUI.FortUINavigationManager.PushSkillTreePage
// 0x0008 (0x0008 - 0x0000)
struct FortUINavigationManager_PushSkillTreePage final
{
public:
	class FName                                   SkillTreePageId;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_PushSkillTreePage;

// Function FortniteUI.FortUINavigationManager.PushSquadManagementScreen
// 0x0010 (0x0010 - 0x0000)
struct FortUINavigationManager_PushSquadManagementScreen final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SquadSlotIndex;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUINavigationManager_PushSquadManagementScreen;

// Function FortniteUI.FortUINavigationManager.SetScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUINavigationManager_SetScrollWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUINavigationManager_SetScrollWidget;

// Function FortniteUI.FortUINavigationManager.TryGetPendingNavigationOp
// 0x0040 (0x0040 - 0x0000)
struct FortUINavigationManager_TryGetPendingNavigationOp final
{
public:
	struct FFortUINavigationOperation             NavigationOp;                                      // 0x0000(0x0038)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUINavigationManager_TryGetPendingNavigationOp;

// Function FortniteUI.FortMultiSizeItemCard.ShouldUseNewItemCards
// 0x0001 (0x0001 - 0x0000)
struct FortMultiSizeItemCard_ShouldUseNewItemCards final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMultiSizeItemCard_ShouldUseNewItemCards;

// Function FortniteUI.FortMultiSizeItemCard.SetCardSize
// 0x0001 (0x0001 - 0x0000)
struct FortMultiSizeItemCard_SetCardSize final
{
public:
	EFortItemCardSize                             CardSize;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMultiSizeItemCard_SetCardSize;

// Function FortniteUI.FortMultiSizeItemCard.SetQuantityOverride
// 0x0004 (0x0004 - 0x0000)
struct FortMultiSizeItemCard_SetQuantityOverride final
{
public:
	int32                                         QuantityOverride_0;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMultiSizeItemCard_SetQuantityOverride;

// Function FortniteUI.FortMultiSizeItemCard.SetShouldCollapseBorderPadding
// 0x0001 (0x0001 - 0x0000)
struct FortMultiSizeItemCard_SetShouldCollapseBorderPadding final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMultiSizeItemCard_SetShouldCollapseBorderPadding;

// Function FortniteUI.FortMultiSizeItemCard.SetShouldDisplayItemAsReward
// 0x0001 (0x0001 - 0x0000)
struct FortMultiSizeItemCard_SetShouldDisplayItemAsReward final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMultiSizeItemCard_SetShouldDisplayItemAsReward;

// Function FortniteUI.FortMultiSizeItemCard.GetCardSize
// 0x0001 (0x0001 - 0x0000)
struct FortMultiSizeItemCard_GetCardSize final
{
public:
	EFortItemCardSize                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMultiSizeItemCard_GetCardSize;

// Function FortniteUI.FortItemPickerBase.CanItemBeComitted
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_CanItemBeComitted final
{
public:
	const class UFortItem*                        ItemToCommit;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortItemPickerBase_CanItemBeComitted;

// Function FortniteUI.FortItemPickerBase.HandlePickerItemClicked
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemClicked final
{
public:
	const class UObject*                          ObjectOfClickedTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_HandlePickerItemClicked;

// Function FortniteUI.FortItemPickerBase.HandlePickerItemDoubleClicked
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemDoubleClicked final
{
public:
	const class UObject*                          ObjectOfClickedTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_HandlePickerItemDoubleClicked;

// Function FortniteUI.FortItemPickerBase.HandlePickerItemHovered
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemHovered final
{
public:
	const class UObject*                          ObjectOfHoveredTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_HandlePickerItemHovered;

// Function FortniteUI.FortItemPickerBase.HandlePickerItemSelected
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_HandlePickerItemSelected final
{
public:
	const class UObject*                          ObjectWhoseSelectionChanged;                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortItemPickerBase_HandlePickerItemSelected;

// Function FortniteUI.FortItemPickerBase.HandlePickerTileCreated
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerTileCreated final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_HandlePickerTileCreated;

// Function FortniteUI.FortItemPickerBase.HandlePickerTileDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerTileDestroyed final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_HandlePickerTileDestroyed;

// Function FortniteUI.FortItemPickerBase.SetSelectedIndex
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_SetSelectedIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortItemPickerBase_SetSelectedIndex;

// Function FortniteUI.FortItemPickerBase.SetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_SetSelectedItem final
{
public:
	const class UFortItem*                        ItemToSelect;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_SetSelectedItem;

// Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem
// 0x0001 (0x0001 - 0x0000)
struct FortItemPickerBase_TryCommitSelectedItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_TryCommitSelectedItem;

// Function FortniteUI.FortItemPickerBase.GetIndexForItem
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_GetIndexForItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortItemPickerBase_GetIndexForItem;

// Function FortniteUI.FortItemPickerBase.GetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_GetSelectedItem final
{
public:
	class UFortItem*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemPickerBase_GetSelectedItem;

// Function FortniteUI.AthenaCustomizationSlotBase.SetCardSize
// 0x0001 (0x0001 - 0x0000)
struct AthenaCustomizationSlotBase_SetCardSize final
{
public:
	EFortItemCardSize                             CardSize;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCustomizationSlotBase_SetCardSize;

// Function FortniteUI.AthenaCustomizationSlotBase.SetIdOfSquadSlotToManageBP
// 0x0010 (0x0010 - 0x0000)
struct AthenaCustomizationSlotBase_SetIdOfSquadSlotToManageBP final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SquadSlotIndex;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaCustomizationSlotBase_SetIdOfSquadSlotToManageBP;

// Function FortniteUI.AthenaCustomizationSlotBase.GetIdOfSquadSlotToManageBP
// 0x0010 (0x0010 - 0x0000)
struct AthenaCustomizationSlotBase_GetIdOfSquadSlotToManageBP final
{
public:
	class FName                                   OutSquadId;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSquadSlotIndex;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaCustomizationSlotBase_GetIdOfSquadSlotToManageBP;

// Function FortniteUI.AthenaCustomizationSlotBase.GetItemInSquadSlotBP
// 0x0010 (0x0010 - 0x0000)
struct AthenaCustomizationSlotBase_GetItemInSquadSlotBP final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCustomizationSlotBase_GetItemInSquadSlotBP;

// Function FortniteUI.AthenaCustomizationSlotBase.IsSquadSlotLockedBP
// 0x0001 (0x0001 - 0x0000)
struct AthenaCustomizationSlotBase_IsSquadSlotLockedBP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCustomizationSlotBase_IsSquadSlotLockedBP;

// Function FortniteUI.FortUserWidget.AddGrantCheatMenu
// 0x0020 (0x0020 - 0x0000)
struct FortUserWidget_AddGrantCheatMenu final
{
public:
	class FString                                 TemplateId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceId;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUserWidget_AddGrantCheatMenu;

// Function FortniteUI.FortUIManagerWidget.CreateUIStateTrigger
// 0x0018 (0x0018 - 0x0000)
struct FortUIManagerWidget_CreateUIStateTrigger final
{
public:
	TSubclassOf<class UFortUIStateTrigger>        Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortUIStateTrigger*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_CreateUIStateTrigger;

// Function FortniteUI.FortUIManagerWidget.GetUIManagerWidget
// 0x0010 (0x0010 - 0x0000)
struct FortUIManagerWidget_GetUIManagerWidget final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortUIManagerWidget*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_GetUIManagerWidget;

// Function FortniteUI.FortUIManagerWidget.KillConfirmationDialog
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_KillConfirmationDialog final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_KillConfirmationDialog;

// Function FortniteUI.FortUIManagerWidget.ShowErrorDialog
// 0x0048 (0x0048 - 0x0000)
struct FortUIManagerWidget_ShowErrorDialog final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OperationDesc;                                     // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   DisplayMessage;                                    // 0x0020(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ErrorCode;                                         // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_ShowErrorDialog;

// Function FortniteUI.FortUIManagerWidget.CreateNotification
// 0x0010 (0x0010 - 0x0000)
struct FortUIManagerWidget_CreateNotification final
{
public:
	TSubclassOf<class UFortUINotification>        UINotificationClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortUINotification*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_CreateNotification;

// Function FortniteUI.FortUIManagerWidget.DisplayErrorDialog
// 0x0080 (0x0080 - 0x0000)
struct FortUIManagerWidget_DisplayErrorDialog final
{
public:
	struct FFortErrorInfo                         Info;                                              // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_DisplayErrorDialog;

// Function FortniteUI.FortUIManagerWidget.DisplayStateContent
// 0x0001 (0x0001 - 0x0000)
struct FortUIManagerWidget_DisplayStateContent final
{
public:
	bool                                          bDisplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_DisplayStateContent;

// Function FortniteUI.FortUIManagerWidget.OnShowConfirmation
// 0x0170 (0x0170 - 0x0000)
struct FortUIManagerWidget_OnShowConfirmation final
{
public:
	struct FFortDialogDescription                 Description;                                       // 0x0000(0x0170)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_OnShowConfirmation;

// Function FortniteUI.FortUIManagerWidget.OnShowConfirmation_NUI
// 0x0180 (0x0180 - 0x0000)
struct FortUIManagerWidget_OnShowConfirmation_NUI final
{
public:
	struct FFortDialogDescription_NUI             Description;                                       // 0x0000(0x0180)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_OnShowConfirmation_NUI;

// Function FortniteUI.FortUIManagerWidget.QueueActionPanelIntoModalLayer
// 0x0010 (0x0010 - 0x0000)
struct FortUIManagerWidget_QueueActionPanelIntoModalLayer final
{
public:
	const class UFortActionHandlerPanel*          Panel;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUIManagerWidget_QueueActionPanelIntoModalLayer;

// Function FortniteUI.FortUIManagerWidget.QueueActivatablePanelIntoModalLayer
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_QueueActivatablePanelIntoModalLayer final
{
public:
	const class UCommonActivatablePanel*          Panel;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_QueueActivatablePanelIntoModalLayer;

// Function FortniteUI.FortUIManagerWidget.RegisterStateTrigger
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_RegisterStateTrigger final
{
public:
	class UFortUIStateTrigger*                    StateTrigger;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_RegisterStateTrigger;

// Function FortniteUI.FortUIManagerWidget.ReleaseNotification
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_ReleaseNotification final
{
public:
	class UFortUINotification*                    Notification;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_ReleaseNotification;

// Function FortniteUI.FortUIManagerWidget.SetStateContentDisplayed
// 0x0001 (0x0001 - 0x0000)
struct FortUIManagerWidget_SetStateContentDisplayed final
{
public:
	bool                                          bDisplay;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_SetStateContentDisplayed;

// Function FortniteUI.FortUIManagerWidget.UnregisterStateTrigger
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_UnregisterStateTrigger final
{
public:
	class UFortUIStateTrigger*                    TriggerToRemove;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_UnregisterStateTrigger;

// Function FortniteUI.FortUIManagerWidget.UpdateStateWidgetContent
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_UpdateStateWidgetContent final
{
public:
	class UFortUIStateWidget*                     StateWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_UpdateStateWidgetContent;

// Function FortniteUI.FortUIManagerWidget._BPGetCurrentUIState
// 0x0001 (0x0001 - 0x0000)
struct FortUIManagerWidget__BPGetCurrentUIState final
{
public:
	EFortUIState                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget__BPGetCurrentUIState;

// Function FortniteUI.FortUIManagerWidget.GetCurrentUIStateWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_GetCurrentUIStateWidget final
{
public:
	class UFortUIStateWidget*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_GetCurrentUIStateWidget;

// Function FortniteUI.FortUIManagerWidget.GetNavigationManager
// 0x0008 (0x0008 - 0x0000)
struct FortUIManagerWidget_GetNavigationManager final
{
public:
	class UFortUINavigationManager*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_GetNavigationManager;

// Function FortniteUI.FortUIManagerWidget.IsStateContentDisplayed
// 0x0001 (0x0001 - 0x0000)
struct FortUIManagerWidget_IsStateContentDisplayed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerWidget_IsStateContentDisplayed;

// Function FortniteUI.FortItemCardBase.PortBrushSize
// 0x0002 (0x0002 - 0x0000)
struct FortItemCardBase_PortBrushSize final
{
public:
	EFortBrushSize                                BrushSize;                                         // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortItemCardSize                             ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemCardBase_PortBrushSize;

// Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory
// 0x0001 (0x0001 - 0x0000)
struct AthenaCustomizationPicker_BeginCustomizationCategory final
{
public:
	EAthenaCustomizationCategory                  Category;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCustomizationPicker_BeginCustomizationCategory;

// Function FortniteUI.FortWorkerSetBonusIcon.SetGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct FortWorkerSetBonusIcon_SetGameplayTag final
{
public:
	struct FGameplayTag                           InGameplayTag;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortWorkerSetBonusIcon_SetGameplayTag;

// Function FortniteUI.AthenaHUDContext.HandleLocalPlayerDBNOStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaHUDContext_HandleLocalPlayerDBNOStateChanged final
{
public:
	bool                                          bIsDBNO;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDContext_HandleLocalPlayerDBNOStateChanged;

// Function FortniteUI.AthenaHUDContext.HandleUIGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct AthenaHUDContext_HandleUIGameplayCue final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDContext_HandleUIGameplayCue;

// Function FortniteUI.AthenaHUDContext.SetSelectedInventoryItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaHUDContext_SetSelectedInventoryItem final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDContext_SetSelectedInventoryItem;

// Function FortniteUI.AthenaHUDContext.GetSelectedInventoryItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaHUDContext_GetSelectedInventoryItem final
{
public:
	class UFortItem*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDContext_GetSelectedInventoryItem;

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHUDElementWidget_HandleOnHUDElementVisibilityChanged;

// Function FortniteUI.AthenaMatchReadyDesktopPopup.UserDismissedDialog
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchReadyDesktopPopup_UserDismissedDialog final
{
public:
	bool                                          bBringToFront;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaMatchReadyDesktopPopup_UserDismissedDialog;

// Function FortniteUI.CMSContext.GetLatestNews
// 0x0040 (0x0040 - 0x0000)
struct CMSContext_GetLatestNews final
{
public:
	struct FAthenaNews                            ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CMSContext_GetLatestNews;

// Function FortniteUI.CMSContext.IsNewNewsAvailable
// 0x0001 (0x0001 - 0x0000)
struct CMSContext_IsNewNewsAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CMSContext_IsNewNewsAvailable;

// Function FortniteUI.FortAbilitySystemContext.RegisterForAttributeChanged
// 0x0040 (0x0040 - 0x0000)
struct FortAbilitySystemContext_RegisterForAttributeChanged final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x0010(0x0020)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             Callback;                                          // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAbilitySystemContext_RegisterForAttributeChanged;

// Function FortniteUI.FortAbilitySystemContext.RemoveDelegatesFromWidget
// 0x0008 (0x0008 - 0x0000)
struct FortAbilitySystemContext_RemoveDelegatesFromWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAbilitySystemContext_RemoveDelegatesFromWidget;

// Function FortniteUI.FortAccountStatsContext.CanShowAccountStats
// 0x0001 (0x0001 - 0x0000)
struct FortAccountStatsContext_CanShowAccountStats final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAccountStatsContext_CanShowAccountStats;

// Function FortniteUI.FortAccountWidgetBase.HandleCurrentlyViewedAccountInfoChanged
// 0x0024 (0x0024 - 0x0000)
struct FortAccountWidgetBase_HandleCurrentlyViewedAccountInfoChanged final
{
public:
	struct FFortPublicAccountInfo                 NewInfo;                                           // 0x0000(0x0024)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAccountWidgetBase_HandleCurrentlyViewedAccountInfoChanged;

// Function FortniteUI.FortAccountWidgetBase.OnAccountInfoChanged
// 0x0024 (0x0024 - 0x0000)
struct FortAccountWidgetBase_OnAccountInfoChanged final
{
public:
	struct FFortPublicAccountInfo                 Result;                                            // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAccountWidgetBase_OnAccountInfoChanged;

// Function FortniteUI.FortAccountWidgetBase.GetNextSeasonChaseReward
// 0x0020 (0x0020 - 0x0000)
struct FortAccountWidgetBase_GetNextSeasonChaseReward final
{
public:
	struct FFortItemInstanceQuantityPair          Reward;                                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         RewardLevel;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartingLevel;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAccountWidgetBase_GetNextSeasonChaseReward;

// Function FortniteUI.FortAccountWidgetBase.GetNextSeasonReward
// 0x0018 (0x0018 - 0x0000)
struct FortAccountWidgetBase_GetNextSeasonReward final
{
public:
	struct FFortItemInstanceQuantityPair          Reward;                                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         RewardLevel;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAccountWidgetBase_GetNextSeasonReward;

// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreCenterWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanel_RestoreCenterWidget;

// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreScrollWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanel_RestoreScrollWidget;

// Function FortniteUI.FortItemTileView.HandleItemWidgetCreated
// 0x0008 (0x0008 - 0x0000)
struct FortItemTileView_HandleItemWidgetCreated final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemTileView_HandleItemWidgetCreated;

// Function FortniteUI.FortItemTileView.SetFilter
// 0x0060 (0x0060 - 0x0000)
struct FortItemTileView_SetFilter final
{
public:
	struct FFortItemFilterDefinition              Filter_0;                                          // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemTileView_SetFilter;

// Function FortniteUI.FortItemTileView.SetFilterAndSorter
// 0x00B0 (0x00B0 - 0x0000)
struct FortItemTileView_SetFilterAndSorter final
{
public:
	struct FFortItemFilterDefinition              Filter_0;                                          // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortItemSorterDefinition              Sorter_0;                                          // 0x0060(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemTileView_SetFilterAndSorter;

// Function FortniteUI.FortItemTileView.SetItemViewContext
// 0x0010 (0x0010 - 0x0000)
struct FortItemTileView_SetItemViewContext final
{
public:
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext_0;                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemTileView_SetItemViewContext;

// Function FortniteUI.FortItemTileView.SetSorter
// 0x0050 (0x0050 - 0x0000)
struct FortItemTileView_SetSorter final
{
public:
	struct FFortItemSorterDefinition              Sorter_0;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortItemTileView_SetSorter;

// Function FortniteUI.FortItemTileView.ContainsItem
// 0x0010 (0x0010 - 0x0000)
struct FortItemTileView_ContainsItem final
{
public:
	const class UFortItem*                        Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortItemTileView_ContainsItem;

// Function FortniteUI.FortTabButtonInterface.SetTabLabelInfo
// 0x00A8 (0x00A8 - 0x0000)
struct FortTabButtonInterface_SetTabLabelInfo final
{
public:
	struct FFortTabButtonLabelInfo                TabLabelInfo;                                      // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortTabButtonInterface_SetTabLabelInfo;

// Function FortniteUI.FortTabListWidgetBase.GetPreregisteredTabInfo
// 0x00E0 (0x00E0 - 0x0000)
struct FortTabListWidgetBase_GetPreregisteredTabInfo final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTabListRegistrationInfo           OutTabInfo;                                        // 0x0008(0x00D0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortTabListWidgetBase_GetPreregisteredTabInfo;

// Function FortniteUI.FortTabListWidgetBase.RegisterFortTab
// 0x00C8 (0x00C8 - 0x0000)
struct FortTabListWidgetBase_RegisterFortTab final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButton>              TabButtonType;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTabButtonLabelInfo                LabelInfo;                                         // 0x0010(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UWidget*                                ContentWidget;                                     // 0x00B8(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
