#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_Stunned

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAB_GenericStunned_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DefaultPlayer_Stunned.GA_DefaultPlayer_Stunned_C
// 0x0098 (0x0B08 - 0x0A70)
class UGA_DefaultPlayer_Stunned_C final : public UGAB_GenericStunned_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_DefaultPlayer_Stunned_C;         // 0x0A70(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           TakerSoulSuckVictimMontage;                        // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_GT_NPCAbilityAttackMeleeSoulSuck;               // 0x0A80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_NPCAbilityAttackMeleeSoulSuckRelease;           // 0x0A88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_NPCAbilityAttackMeleeSoulSuck;                  // 0x0A90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPawn*                              PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoulSuckMontageSection;                            // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoulSuckCurrentMontageSection;                     // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SoulSuckGoalActorNormalizedHealth;                 // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACC[0x4];                                      // 0x0ACC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortFeedbackHandle                    StunFeedbackEvent;                                 // 0x0AD0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UClass*                                 SoulSuckCameraShake;                               // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraAnimInst*                        SoulSuckCameraAnimInst;                            // 0x0AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   PlayerCameraManager;                               // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_DefaultPlayer_Stunned(int32 EntryPoint);
	void SoulSuckEndCheck();
	void ResetSoulSuckRelease();
	void SoulSuckCheck();
	void ResetSoulSuckLift();
	void K2_OnEndAbility();
	void K2_ActivateAbility();
	void OnCompleted_B4CDDE17442A807B7592E7A70F4F6DEF();
	void OnBlendOut_B4CDDE17442A807B7592E7A70F4F6DEF();
	void OnInterrupted_B4CDDE17442A807B7592E7A70F4F6DEF();
	void OnCancelled_B4CDDE17442A807B7592E7A70F4F6DEF();
	void OnComplete_F3FA8C4A4CF8BA1E44F6768A402E7D71();
	void OnInterrupted_F3FA8C4A4CF8BA1E44F6768A402E7D71();
	void Triggered_3C8EA97E467ED88E163FF0B4F830736D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_3C8EA97E467ED88E163FF0B4F830736D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_3C8EA97E467ED88E163FF0B4F830736D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DefaultPlayer_Stunned_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DefaultPlayer_Stunned_C")
	}
	static class UGA_DefaultPlayer_Stunned_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DefaultPlayer_Stunned_C>();
	}
};
DUMPER7_ASSERTS_UGA_DefaultPlayer_Stunned_C;

}

