#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_HarvestBuffSwitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DefaultPlayer_HarvestBuffSwitch.GA_DefaultPlayer_HarvestBuffSwitch_C
// 0x00D0 (0x0B10 - 0x0A40)
class UGA_DefaultPlayer_HarvestBuffSwitch_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A40(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagContainer                  TC_ImpactWeapon;                                   // 0x0A48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_HarvestBuff_T1;                                 // 0x0A68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_LaserFocus;                                     // 0x0A88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_LaserFocus;                                     // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_ImpactWeapon_Stick;                             // 0x0AB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_ImpactWeapon_Pickaxe;                           // 0x0AD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_HarvestBuff_T2;                                 // 0x0AF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_DefaultPlayer_HarvestBuffSwitch(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DefaultPlayer_HarvestBuffSwitch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DefaultPlayer_HarvestBuffSwitch_C")
	}
	static class UGA_DefaultPlayer_HarvestBuffSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DefaultPlayer_HarvestBuffSwitch_C>();
	}
};
DUMPER7_ASSERTS_UGA_DefaultPlayer_HarvestBuffSwitch_C;

}

