#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_TakerMarkedForDeath

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_TakerMarkedForDeath.GCN_TakerMarkedForDeath_C
// 0x0050 (0x04B8 - 0x0468)
class AGCN_TakerMarkedForDeath_C final : public AFortGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               OverHeadEffect;                                    // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                  MiniMapCrosshair;                                  // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                  MiniMapIconBackground;                             // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FFortFeedbackHandle                    TakerFeedbackEvent;                                // 0x0488(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         TakerFeedbackRepeatDelay;                          // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TakerFeedbackInitialDelay;                         // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_GameplayStatusStun;                             // 0x04A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerIsStunned;                                   // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GCN_TakerMarkedForDeath(int32 EntryPoint);
	void SoulSuckCheck();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GCN_TakerMarkedForDeath_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GCN_TakerMarkedForDeath_C")
	}
	static class AGCN_TakerMarkedForDeath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_TakerMarkedForDeath_C>();
	}
};
DUMPER7_ASSERTS_AGCN_TakerMarkedForDeath_C;

}

