#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_PickupItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD-PickupItemWidget.HUD-PickupItemWidget_C
// 0x0038 (0x0270 - 0x0238)
class UHUD_PickupItemWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageBackpack;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDetailsHeader_C*                   ItemDetailsHeader;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxInteractionFailure;                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionFailure;                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortPickup*                            Pickup;                                            // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItem*                              PickupItem;                                        // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUD_PickupItemWidget(int32 EntryPoint);
	void Construct();
	void InitializeItemData();
	void InitializeInteractionFailureText();
	void SetPickup(class AFortPickup* NewPickup);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HUD-PickupItemWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUD-PickupItemWidget_C")
	}
	static class UHUD_PickupItemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_PickupItemWidget_C>();
	}
};
DUMPER7_ASSERTS_UHUD_PickupItemWidget_C;

}

