#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectEvolutionChoiceEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PanelButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectEvolutionChoiceEntry.ItemInspectEvolutionChoiceEntry_C
// 0x0070 (0x0940 - 0x08D0)
class UItemInspectEvolutionChoiceEntry_C final : public UPanelButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemInspectEvolutionChoiceEntry_C;  // 0x08D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Grow;                                              // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DisabledOverlay;                                   // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnEvolutionChoiceHovered;                          // 0x0900(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEvolutionChoiceUnhovered;                        // 0x0910(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEvolutionChoiceSelected;                         // 0x0920(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFortItem*                              ItemRepresented;                                   // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecipeIndexRepresented;                            // 0x0938(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemInspectEvolutionChoiceEntry(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnSelected();
	void SetItemToRepresent(class UFortItem* Item, int32 RecipeIndex, bool EnabledChoice);
	void DoDesignTimeRandomization();
	void SelectEvolutionChoice();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ItemInspectEvolutionChoiceEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemInspectEvolutionChoiceEntry_C")
	}
	static class UItemInspectEvolutionChoiceEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectEvolutionChoiceEntry_C>();
	}
};
DUMPER7_ASSERTS_UItemInspectEvolutionChoiceEntry_C;

}

