#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementMulchConfirmationDialogContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemManagementMulchConfirmationDialogContent.ItemManagementMulchConfirmationDialogContent_C
// 0x0038 (0x0270 - 0x0238)
class UItemManagementMulchConfirmationDialogContent_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UScrollBox*                             ItemScrollBox;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemSlots;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFortItem*>                      ItemList;                                          // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	TArray<int32>                                 ItemCounts;                                        // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ItemManagementMulchConfirmationDialogContent(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ItemManagementMulchConfirmationDialogContent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemManagementMulchConfirmationDialogContent_C")
	}
	static class UItemManagementMulchConfirmationDialogContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemManagementMulchConfirmationDialogContent_C>();
	}
};
DUMPER7_ASSERTS_UItemManagementMulchConfirmationDialogContent_C;

}

