#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyItem_DO_NOT_USE

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ItemTextureSet_structs.hpp"
#include "ItemDisplayStyle_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "ItemDisplayMode_structs.hpp"
#include "ItemTextureStylesheet_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyItem_DO_NOT_USE.LegacyItem_DO_NOT_USE_C
// 0x1508 (0x1DA8 - 0x08A0)
class ULegacyItem_DO_NOT_USE_C final : public UFortItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                Border_SecondaryIconFill;                          // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_SecondaryIconFrame;                         // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_TertiaryIconFill;                           // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_TertiaryIconFrame;                          // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_SubtypeIcons;                        // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BaseMaterial;                                // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Chamfer;                                     // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PrimaryIcon;                                 // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SecondaryIcon;                               // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TertiaryIcon;                                // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AmmoCounter;                                  // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_SubtypeIconsAmmoCount;                 // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCooldownMeter_C*                   Widget_CooldownMeter;                              // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDurabilityMeter_C*                 Widget_DurabilityMeter;                            // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyRatingWidget_C*                  Widget_Rating;                                     // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemStackCounter_C*                    Widget_StackCounter;                               // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItem_TierBadge_C*                      Widget_TierBadge;                                  // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortRarityItemData                    RarityData;                                        // 0x0938(0x0080)(Edit, BlueprintVisible)
	bool                                          CanBeDragged;                                      // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_9B9[0x7];                                      // 0x09B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DragTagString;                                     // 0x09C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItem*                              ItemData;                                          // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemDisplayMode                              DisplayMode;                                       // 0x09D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemDisplayStyle                             DisplayStyle;                                      // 0x09D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DA[0x6];                                      // 0x09DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemTextureSet                        Item_Textures;                                     // 0x09E0(0x0A28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FItemTextureStylesheet                 Item_Texture_Stylesheet;                           // 0x1408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FFortMultiSizeBrush                    Subtype_Icon_Frame;                                // 0x1418(0x0360)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeFont                     AmmoMultiFont;                                     // 0x1778(0x0270)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TooltipHeaderText;                                 // 0x19E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USlateBrushAsset*                       TooltipHeaderIcon;                                 // 0x1A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InfiniteAmmo;                                      // 0x1A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A09[0x7];                                     // 0x1A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    DemoItemData;                                      // 0x1A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMultiSizeBrush                    Subtype_Icon_Fill;                                 // 0x1A18(0x0360)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Subtype_Fill_Color;                                // 0x1D78(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Subtype_Frame_Color;                               // 0x1D88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideSecondaryTypeIconColor;                    // 0x1D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowSecondaryTypeIcon;                             // 0x1D99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowTertiaryTypeIcon;                              // 0x1D9A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OverrideTertiaryTypeIconColor;                     // 0x1D9B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OverridePrimaryIconVisibility;                     // 0x1D9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowStackCounter;                                  // 0x1D9D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          OverrideDisplayStyle;                              // 0x1D9E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowPrimaryIcon;                                   // 0x1D9F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDropOccured;                                      // 0x1DA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LegacyItem_DO_NOT_USE(int32 EntryPoint);
	void BPOnActivatableChanged(bool bNewActivatable);
	void BPOnCooldownSecondsChanged(int32 NewCooldownSeconds);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void BPOnItemSet(class UFortItem* NewItem);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BPOnItemChanged();
	void Update_Base_Material();
	void Set_Item_Data(class UFortItem* Item_Data);
	void Update_Stack_Counter();
	void Update_All();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void Update_Size_Box();
	void Get_Item_Texture_Set(EItemDisplayStyle Display_Style, struct FItemTextureSet* Texture_Set);
	void Update_Primary_Icon();
	void Update_Tier_Badge();
	void Get_Display_Style(EFortItemType Item_Type, EItemDisplayStyle* Style_0);
	void Update_Subtype_Icons___Ammo();
	void Set_Ammo_Count(int32 Count);
	void Set_Display_Mode(EFortUIState Current_UI_State, bool Cursor_Mode);
	class UWidget* Get_Item_Tooltip(int32 OverrideStackCount);
	void Set_Tooltip_Header(const class FText& Header_Text, class USlateBrushAsset* Icon_Brush);
	void Update_Durability_Meter();
	void Update_Cooldown_Meter();
	void Set_Durability(float Durability);
	void Set_Stack_Count(int32 Count);
	void Refresh();
	void Resize(EFortBrushSize Brush_Size);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	void Set_Subtype_Icons___Ammo_Color(bool Override_Secondary_Icon_Color, const struct FLinearColor& Secondary_Icon_Override_Color, bool Override_Tertiary_Icon_Color, const struct FLinearColor& Tertiary_Icon_Override_Color);
	void Set_Primary_Icon_Visibility(bool Override_Icon_Visibility, ESlateVisibility Item_Icon_Visibility);
	void Hide_Subtype_Icons();
	void Set_Display_Style(bool Override_Display_Style, EItemDisplayStyle DisplayStyle_0);
	int32 Get_Num_in_Stack();
	void Get_Texture2D_From_Multi_Size_Brush(const struct FFortMultiSizeBrush& Multi_Size_Brush, EFortBrushSize Brush_Size, class UTexture2D** Texture2D, bool* Success);
	void Update_Rating_Tag();
	void Update_Activatable_State(bool Activatable);
	void Update_Base_Opacity();
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LegacyItem_DO_NOT_USE_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LegacyItem_DO_NOT_USE_C")
	}
	static class ULegacyItem_DO_NOT_USE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyItem_DO_NOT_USE_C>();
	}
};
DUMPER7_ASSERTS_ULegacyItem_DO_NOT_USE_C;

}

