#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginScreen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoginScreen.LoginScreen_C
// 0x00F0 (0x0520 - 0x0430)
class ULoginScreen_C final : public UFortUIStateWidget_Login
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BackBorder;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      BackButton;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConsoleProfileWidget_C*                ConsoleProfileWidget;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoginBackground_C*                     LoginBackground;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetStack*                     LoginFlowStack;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      Widget_BuildWatermark;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             Sound_Login_Clicked;                               // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Login_Failed;                                // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Login_Music;                                 // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Login_Quit;                                  // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      FrontEnd_Music_Controller;                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusWidget_C*                        StatusWindow;                                      // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USignInWidget_C*                        SignInWindow;                                      // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUserWidget*                      AccountLinkWindow;                                 // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoginMenuVisible;                                 // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoginResultWIdget_C*                   LoginResultWindow;                                 // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEulaWidget_C*                          EulaWindow;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   BenchmarkDialogTitle;                              // 0x04D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   BenchmarkDialogMessage;                            // 0x04E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UObject*                                LoginMenuWidget;                                   // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplashScreenWidget_C*                  SplashScreenWindow;                                // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      test;                                              // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoginAccountSelect_C*                  AccountSelectWindow;                               // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoginScreen(int32 EntryPoint);
	void OnShowLoginMessage(bool bShow, const class FText& Tile, const class FText& Body);
	void OnPostLoginLogoutComplete(const class FText& Reason);
	void HandleOnLoginAccountTypeSelected(EFortLoginAccountType LoginAccountType);
	void OnDisplayErrorComplete();
	void OnNeedsPurchaseOrAccountLinking(bool bLinkedAccountNeedsPurchase);
	void HandleViewOnlyClose();
	void AccountLinking_ViewEula();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnLogoutComplete();
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void OnSplashScreenClosed();
	void AccountLinking_RequestAutoLogin();
	void AccountLinking_RequestSignIn();
	void AccountLinking_LinkingFailed(const class FText& FailReason);
	void AccountLinking_PopStatus();
	void AccountLinking_PushStatus(const class FText& StatusText);
	void HandlerBenchmarkFlow();
	void HandleResultConfirmed();
	void HandleEulaResponse(bool Accepted);
	void OnEulaAvailable(const class FText& EulaText);
	void OnLoginSuceeded();
	void OnLoginFailed(const class FText& Reason);
	void HandleOnStartLogin(const class FString& LoginEmail, const class FString& LoginPassword);
	void OnExitState(EFortUIState NextUIState);
	void OnEnterState(EFortUIState PreviousUIState);
	void OnPatchingComplete(bool bProceed);
	void Construct();
	void DialogResult_B952A8754B3836D2151B4981F531542E(EFortDialogResult Result, class FName ResultName);
	void DialogResult_EE7DC32F44B9651770AED08101A03510(EFortDialogResult Result, class FName ResultName);
	void ShowSignInWindow(bool DirectSignIn);
	void ShowStatusWindow(const class FText& StatusText);
	void ShowAccountLinkingWindow(bool InLinkedAccountNeedsPurchase);
	void UpdateStatusTitle(const class FText& Title);
	void ToggleLoginMenu();
	void ShowResultWindow(const class FText& Title, const class FText& Description, bool bShowError);
	void SetResultTitle(const class FText& Title, bool bShowError);
	void SetResultsDescription(const class FText& Description);
	void ShowEulaWindow(const class FText& Text, bool ViewOnly);
	void ShouldShowBenchmark(bool* Return_Value);
	void RunBenchmark();
	void SkipBenchmark();
	struct FEventReply OnMouseButtonUp_MenuBorder(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	class UWidget* GetLoginMenu();
	void ShowSplashScreen();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void RollbackToSplashScreen();
	void HideNonSplashScreenContent();
	void EmptyLoginStack();
	void CheckSkipSplashScreen();
	void ShowAccountSelectWindow();
	void SafePopContent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LoginScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoginScreen_C")
	}
	static class ULoginScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoginScreen_C>();
	}
};
DUMPER7_ASSERTS_ULoginScreen_C;

}

