#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaAssets

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MediaAssets.EMediaPlayerTrack
// NumValues: 0x0008
enum class EMediaPlayerTrack : uint8
{
	Audio                                    = 0,
	Binary                                   = 1,
	Caption                                  = 2,
	Script                                   = 3,
	Subtitle                                 = 4,
	Text                                     = 5,
	Video                                    = 6,
	EMediaPlayerTrack_MAX                    = 7,
};

// ScriptStruct MediaAssets.MediaPlayerOverlay
// 0x0028 (0x0028 - 0x0000)
struct FMediaPlayerOverlay final
{
public:
	bool                                          HasPosition;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Position;                                          // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0010(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMediaPlayerOverlay;

}

