#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaAssets

#include "Basic.hpp"

#include "MediaAssets_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MediaAssets.MediaOverlays.GetCaptions
// 0x0018 (0x0018 - 0x0000)
struct MediaOverlays_GetCaptions final
{
public:
	TArray<struct FMediaPlayerOverlay>            OutCaptions;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTimespan                              Time;                                              // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaOverlays_GetCaptions;

// Function MediaAssets.MediaOverlays.GetSubtitles
// 0x0018 (0x0018 - 0x0000)
struct MediaOverlays_GetSubtitles final
{
public:
	TArray<struct FMediaPlayerOverlay>            OutSubtitles;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTimespan                              Time;                                              // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaOverlays_GetSubtitles;

// Function MediaAssets.MediaOverlays.GetTexts
// 0x0018 (0x0018 - 0x0000)
struct MediaOverlays_GetTexts final
{
public:
	TArray<struct FMediaPlayerOverlay>            OutTexts;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTimespan                              Time;                                              // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaOverlays_GetTexts;

// Function MediaAssets.MediaPlayer.CanPlaySource
// 0x0010 (0x0010 - 0x0000)
struct MediaPlayer_CanPlaySource final
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_CanPlaySource;

// Function MediaAssets.MediaPlayer.CanPlayUrl
// 0x0018 (0x0018 - 0x0000)
struct MediaPlayer_CanPlayUrl final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_CanPlayUrl;

// Function MediaAssets.MediaPlayer.GetForwardRates
// 0x0014 (0x0014 - 0x0000)
struct MediaPlayer_GetForwardRates final
{
public:
	bool                                          Unthinned;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetForwardRates;

// Function MediaAssets.MediaPlayer.GetReverseRates
// 0x0014 (0x0014 - 0x0000)
struct MediaPlayer_GetReverseRates final
{
public:
	bool                                          Unthinned;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRange                            ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetReverseRates;

// Function MediaAssets.MediaPlayer.Next
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_Next final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_Next;

// Function MediaAssets.MediaPlayer.OpenFile
// 0x0018 (0x0018 - 0x0000)
struct MediaPlayer_OpenFile final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_OpenFile;

// Function MediaAssets.MediaPlayer.OpenPlaylist
// 0x0010 (0x0010 - 0x0000)
struct MediaPlayer_OpenPlaylist final
{
public:
	class UMediaPlaylist*                         InPlaylist;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_OpenPlaylist;

// Function MediaAssets.MediaPlayer.OpenPlaylistIndex
// 0x0010 (0x0010 - 0x0000)
struct MediaPlayer_OpenPlaylistIndex final
{
public:
	class UMediaPlaylist*                         InPlaylist;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_OpenPlaylistIndex;

// Function MediaAssets.MediaPlayer.OpenSource
// 0x0010 (0x0010 - 0x0000)
struct MediaPlayer_OpenSource final
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_OpenSource;

// Function MediaAssets.MediaPlayer.OpenUrl
// 0x0018 (0x0018 - 0x0000)
struct MediaPlayer_OpenUrl final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_OpenUrl;

// Function MediaAssets.MediaPlayer.Pause
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_Pause final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_Pause;

// Function MediaAssets.MediaPlayer.Play
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_Play final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_Play;

// Function MediaAssets.MediaPlayer.Previous
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_Previous final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_Previous;

// Function MediaAssets.MediaPlayer.Reopen
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_Reopen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_Reopen;

// Function MediaAssets.MediaPlayer.Rewind
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_Rewind final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_Rewind;

// Function MediaAssets.MediaPlayer.Seek
// 0x0010 (0x0010 - 0x0000)
struct MediaPlayer_Seek final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_Seek;

// Function MediaAssets.MediaPlayer.SelectTrack
// 0x000C (0x000C - 0x0000)
struct MediaPlayer_SelectTrack final
{
public:
	EMediaPlayerTrack                             TrackType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TrackIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_SelectTrack;

// Function MediaAssets.MediaPlayer.SetDesiredPlayerName
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_SetDesiredPlayerName final
{
public:
	class FName                                   PlayerName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_SetDesiredPlayerName;

// Function MediaAssets.MediaPlayer.SetLooping
// 0x0002 (0x0002 - 0x0000)
struct MediaPlayer_SetLooping final
{
public:
	bool                                          Looping;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_SetLooping;

// Function MediaAssets.MediaPlayer.SetOverlays
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_SetOverlays final
{
public:
	class UMediaOverlays*                         NewOverlays;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_SetOverlays;

// Function MediaAssets.MediaPlayer.SetRate
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_SetRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_SetRate;

// Function MediaAssets.MediaPlayer.SetSoundWave
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_SetSoundWave final
{
public:
	class UMediaSoundWave*                        NewSoundWave;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_SetSoundWave;

// Function MediaAssets.MediaPlayer.SetVideoTexture
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_SetVideoTexture final
{
public:
	class UMediaTexture*                          NewTexture;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_SetVideoTexture;

// Function MediaAssets.MediaPlayer.CanPause
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_CanPause final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_CanPause;

// Function MediaAssets.MediaPlayer.GetDesiredPlayerName
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_GetDesiredPlayerName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetDesiredPlayerName;

// Function MediaAssets.MediaPlayer.GetDuration
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_GetDuration final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetDuration;

// Function MediaAssets.MediaPlayer.GetNumTracks
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_GetNumTracks final
{
public:
	EMediaPlayerTrack                             TrackType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetNumTracks;

// Function MediaAssets.MediaPlayer.GetPlayerName
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_GetPlayerName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetPlayerName;

// Function MediaAssets.MediaPlayer.GetRate
// 0x0004 (0x0004 - 0x0000)
struct MediaPlayer_GetRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetRate;

// Function MediaAssets.MediaPlayer.GetSelectedTrack
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_GetSelectedTrack final
{
public:
	EMediaPlayerTrack                             TrackType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetSelectedTrack;

// Function MediaAssets.MediaPlayer.GetTime
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_GetTime final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetTime;

// Function MediaAssets.MediaPlayer.GetTrackDisplayName
// 0x0020 (0x0020 - 0x0000)
struct MediaPlayer_GetTrackDisplayName final
{
public:
	EMediaPlayerTrack                             TrackType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TrackIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetTrackDisplayName;

// Function MediaAssets.MediaPlayer.GetTrackLanguage
// 0x0018 (0x0018 - 0x0000)
struct MediaPlayer_GetTrackLanguage final
{
public:
	EMediaPlayerTrack                             TrackType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TrackIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetTrackLanguage;

// Function MediaAssets.MediaPlayer.GetUrl
// 0x0010 (0x0010 - 0x0000)
struct MediaPlayer_GetUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_GetUrl;

// Function MediaAssets.MediaPlayer.IsLooping
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_IsLooping final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_IsLooping;

// Function MediaAssets.MediaPlayer.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_IsPaused;

// Function MediaAssets.MediaPlayer.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_IsPlaying;

// Function MediaAssets.MediaPlayer.IsPreparing
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_IsPreparing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_IsPreparing;

// Function MediaAssets.MediaPlayer.IsReady
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_IsReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_IsReady;

// Function MediaAssets.MediaPlayer.SupportsRate
// 0x0008 (0x0008 - 0x0000)
struct MediaPlayer_SupportsRate final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Unthinned;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlayer_SupportsRate;

// Function MediaAssets.MediaPlayer.SupportsScrubbing
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_SupportsScrubbing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_SupportsScrubbing;

// Function MediaAssets.MediaPlayer.SupportsSeeking
// 0x0001 (0x0001 - 0x0000)
struct MediaPlayer_SupportsSeeking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlayer_SupportsSeeking;

// Function MediaAssets.MediaPlaylist.Add
// 0x0008 (0x0008 - 0x0000)
struct MediaPlaylist_Add final
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_Add;

// Function MediaAssets.MediaPlaylist.Get
// 0x0010 (0x0010 - 0x0000)
struct MediaPlaylist_Get final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_Get;

// Function MediaAssets.MediaPlaylist.GetNext
// 0x0010 (0x0010 - 0x0000)
struct MediaPlaylist_GetNext final
{
public:
	int32                                         InOutIndex;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_GetNext;

// Function MediaAssets.MediaPlaylist.GetPrevious
// 0x0010 (0x0010 - 0x0000)
struct MediaPlaylist_GetPrevious final
{
public:
	int32                                         InOutIndex;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_GetPrevious;

// Function MediaAssets.MediaPlaylist.GetRandom
// 0x0010 (0x0010 - 0x0000)
struct MediaPlaylist_GetRandom final
{
public:
	int32                                         InOutIndex;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_GetRandom;

// Function MediaAssets.MediaPlaylist.Insert
// 0x0010 (0x0010 - 0x0000)
struct MediaPlaylist_Insert final
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaPlaylist_Insert;

// Function MediaAssets.MediaPlaylist.Num
// 0x0004 (0x0004 - 0x0000)
struct MediaPlaylist_Num final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_Num;

// Function MediaAssets.MediaPlaylist.Remove
// 0x0008 (0x0008 - 0x0000)
struct MediaPlaylist_Remove final
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_Remove;

// Function MediaAssets.MediaPlaylist.RemoveAt
// 0x0004 (0x0004 - 0x0000)
struct MediaPlaylist_RemoveAt final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaPlaylist_RemoveAt;

// Function MediaAssets.FileMediaSource.SetFilePath
// 0x0010 (0x0010 - 0x0000)
struct FileMediaSource_SetFilePath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FileMediaSource_SetFilePath;

// Function MediaAssets.MediaTexture.GetAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct MediaTexture_GetAspectRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaTexture_GetAspectRatio;

// Function MediaAssets.MediaTexture.GetHeight
// 0x0004 (0x0004 - 0x0000)
struct MediaTexture_GetHeight final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaTexture_GetHeight;

// Function MediaAssets.MediaTexture.GetWidth
// 0x0004 (0x0004 - 0x0000)
struct MediaTexture_GetWidth final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaTexture_GetWidth;

}

