#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionAlertIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MissionAlertIndicator.MissionAlertIndicator_C.ExecuteUbergraph_MissionAlertIndicator
// 0x0004 (0x0004 - 0x0000)
struct MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator;

// Function MissionAlertIndicator.MissionAlertIndicator_C.ToggleTimer
// 0x0020 (0x0020 - 0x0000)
struct MissionAlertIndicator_C_ToggleTimer final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
};
DUMPER7_ASSERTS_MissionAlertIndicator_C_ToggleTimer;

}

