#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Niagara_structs.hpp"
#include "MovieScene_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Niagara.NiagaraActor
// 0x0008 (0x0390 - 0x0388)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0388(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraActor")
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
DUMPER7_ASSERTS_ANiagaraActor;

// Class Niagara.NiagaraComponent
// 0x0030 (0x06A0 - 0x0670)
class UNiagaraComponent final : public UPrimitiveComponent
{
public:
	class UNiagaraEffect*                         Asset;                                             // 0x0670(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_678[0x10];                                     // 0x0678(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraVariable>               EffectParameterLocalOverrides;                     // 0x0688(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraComponent")
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
DUMPER7_ASSERTS_UNiagaraComponent;

// Class Niagara.NiagaraDataInterface
// 0x0000 (0x0028 - 0x0028)
class UNiagaraDataInterface : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterface")
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterface;

// Class Niagara.NiagaraDataInterfaceCurve
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataInterfaceCurve final : public UNiagaraDataInterface
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCurve")
	}
	static class UNiagaraDataInterfaceCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCurve;

// Class Niagara.NiagaraDataInterfaceVectorCurve
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataInterfaceVectorCurve final : public UNiagaraDataInterface
{
public:
	class UCurveVector*                           Curve;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVectorCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVectorCurve")
	}
	static class UNiagaraDataInterfaceVectorCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVectorCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVectorCurve;

// Class Niagara.NiagaraDataInterfaceColorCurve
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataInterfaceColorCurve final : public UNiagaraDataInterface
{
public:
	class UCurveLinearColor*                      Curve;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceColorCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceColorCurve")
	}
	static class UNiagaraDataInterfaceColorCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceColorCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceColorCurve;

// Class Niagara.NiagaraEffect
// 0x0028 (0x0050 - 0x0028)
class UNiagaraEffect final : public UObject
{
public:
	TArray<struct FNiagaraEmitterHandle>          EmitterHandles;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	class UNiagaraScript*                         EffectScript;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNiagaraParameterBinding>       ParameterBindings;                                 // 0x0040(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEffect")
	}
	static class UNiagaraEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEffect>();
	}
};
DUMPER7_ASSERTS_UNiagaraEffect;

// Class Niagara.NiagaraEffectRendererProperties
// 0x0000 (0x0028 - 0x0028)
class UNiagaraEffectRendererProperties : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEffectRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEffectRendererProperties")
	}
	static class UNiagaraEffectRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEffectRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraEffectRendererProperties;

// Class Niagara.NiagaraMeshRendererProperties
// 0x0008 (0x0030 - 0x0028)
class UNiagaraMeshRendererProperties final : public UNiagaraEffectRendererProperties
{
public:
	class UStaticMesh*                            ParticleMesh;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraMeshRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraMeshRendererProperties")
	}
	static class UNiagaraMeshRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraMeshRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraMeshRendererProperties;

// Class Niagara.NiagaraRibbonRendererProperties
// 0x0000 (0x0028 - 0x0028)
class UNiagaraRibbonRendererProperties final : public UNiagaraEffectRendererProperties
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraRibbonRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraRibbonRendererProperties")
	}
	static class UNiagaraRibbonRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRibbonRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraRibbonRendererProperties;

// Class Niagara.NiagaraSpriteRendererProperties
// 0x0010 (0x0038 - 0x0028)
class UNiagaraSpriteRendererProperties final : public UNiagaraEffectRendererProperties
{
public:
	struct FVector2D                              SubImageInfo;                                      // 0x0028(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBVelocityAligned;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSpriteRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSpriteRendererProperties")
	}
	static class UNiagaraSpriteRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSpriteRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraSpriteRendererProperties;

// Class Niagara.NiagaraScript
// 0x00A0 (0x00C8 - 0x0028)
class UNiagaraScript final : public UObject
{
public:
	TArray<uint8>                                 ByteCode;                                          // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraParameters                     Parameters;                                        // 0x0038(0x0010)(NativeAccessSpecifierPublic)
	struct FNiagaraParameters                     InternalParameters;                                // 0x0048(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               Attributes;                                        // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraDataSetProperties>      EventReceivers;                                    // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraDataSetProperties>      EventGenerators;                                   // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraScriptDataUsageInfo            DataUsage;                                         // 0x0088(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	ENiagaraScriptUsage                           Usage;                                             // 0x0089(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraScriptDataInterfaceInfo> DataInterfaceInfo;                                // 0x0090(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ENiagaraNumericOutputTypeSelectionMode        NumericOutputTypeSelectionMode;                    // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x27];                                      // 0x00A1(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraScript")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraScript")
	}
	static class UNiagaraScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraScript>();
	}
};
DUMPER7_ASSERTS_UNiagaraScript;

// Class Niagara.NiagaraEventReceiverEmitterAction
// 0x0000 (0x0028 - 0x0028)
class UNiagaraEventReceiverEmitterAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEventReceiverEmitterAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEventReceiverEmitterAction")
	}
	static class UNiagaraEventReceiverEmitterAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEventReceiverEmitterAction>();
	}
};
DUMPER7_ASSERTS_UNiagaraEventReceiverEmitterAction;

// Class Niagara.NiagaraEventReceiverEmitterAction_SpawnParticles
// 0x0008 (0x0030 - 0x0028)
class UNiagaraEventReceiverEmitterAction_SpawnParticles final : public UNiagaraEventReceiverEmitterAction
{
public:
	uint32                                        NumParticles;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEventReceiverEmitterAction_SpawnParticles")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEventReceiverEmitterAction_SpawnParticles")
	}
	static class UNiagaraEventReceiverEmitterAction_SpawnParticles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEventReceiverEmitterAction_SpawnParticles>();
	}
};
DUMPER7_ASSERTS_UNiagaraEventReceiverEmitterAction_SpawnParticles;

// Class Niagara.NiagaraEmitterProperties
// 0x00D8 (0x0100 - 0x0028)
class UNiagaraEmitterProperties final : public UObject
{
public:
	float                                         SpawnRate;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalSpace;                                       // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              Material;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoops;                                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraCollisionMode                         CollisionMode;                                     // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraEffectRendererProperties*       RendererProperties;                                // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraEmitterScriptProperties        UpdateScriptProps;                                 // 0x0050(0x0028)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FNiagaraEmitterScriptProperties        SpawnScriptProps;                                  // 0x0078(0x0028)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FNiagaraEventScriptProperties          EventHandlerScriptProps;                           // 0x00A0(0x0050)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraEmitterBurst>           Bursts;                                            // 0x00F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEmitterProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEmitterProperties")
	}
	static class UNiagaraEmitterProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEmitterProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraEmitterProperties;

// Class Niagara.NiagaraFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UNiagaraComponent* SpawnEffectAtLocation(class UObject* WorldContextObject, class UNiagaraEffect* EffectTemplate, const struct FVector& Location, const struct FRotator& Rotation, bool bAutoDestroy);
	static class UNiagaraComponent* SpawnEffectAttached(class UNiagaraEffect* EffectTemplate, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, EAttachLocation LocationType, bool bAutoDestroy);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraFunctionLibrary")
	}
	static class UNiagaraFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UNiagaraFunctionLibrary;

// Class Niagara.NiagaraScriptSourceBase
// 0x0020 (0x0048 - 0x0028)
class UNiagaraScriptSourceBase final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraScriptSourceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraScriptSourceBase")
	}
	static class UNiagaraScriptSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraScriptSourceBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraScriptSourceBase;

// Class Niagara.NiagaraSequence
// 0x0008 (0x02E0 - 0x02D8)
class UNiagaraSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSequence")
	}
	static class UNiagaraSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSequence>();
	}
};
DUMPER7_ASSERTS_UNiagaraSequence;

// Class Niagara.NiagaraSettings
// 0x0030 (0x0068 - 0x0038)
class UNiagaraSettings final : public UDeveloperSettings
{
public:
	struct FStringAssetReference                  DefaultEffect;                                     // 0x0038(0x0010)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStringAssetReference                  DefaultEmitter;                                    // 0x0048(0x0010)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStringAssetReference                  DefaultScript;                                     // 0x0058(0x0010)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSettings")
	}
	static class UNiagaraSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSettings>();
	}
};
DUMPER7_ASSERTS_UNiagaraSettings;

}

