#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutpostScreenStormShieldPermissions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OutpostScreenStormShieldPermissions.OutpostScreenStormShieldPermissions_C
// 0x0030 (0x0410 - 0x03E0)
class UOutpostScreenStormShieldPermissions_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UOutpostScreenCanEditPanel_C*           OutpostScreenCanEditPanel;                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          GetHelp;                                           // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   CloseOutpostScreen;                                // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UOutpostScreenStormShield_C*            ParentReference;                                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OutpostScreenStormShieldPermissions(int32 EntryPoint);
	void OnActivated();
	void UpdatePrivilagesEvent_1(int32 PlayerIndex);
	void UpdatePrivilagesEvent_0(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void Construct();
	void isPlayerAlone(bool* isAlone);
	void UpdatePrivilages();
	bool IsOwningPlayerOutpostOwner();
	void AddInputHandlers();
	void HandleBack(bool* PassThrough);
	void SetParent(class UOutpostScreenStormShield_C* ParentWidget);
	void CenterWidget();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("OutpostScreenStormShieldPermissions_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OutpostScreenStormShieldPermissions_C")
	}
	static class UOutpostScreenStormShieldPermissions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutpostScreenStormShieldPermissions_C>();
	}
};
DUMPER7_ASSERTS_UOutpostScreenStormShieldPermissions_C;

}

