#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerChoiceButtonWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerChoiceButtonWidget.PlayerChoiceButtonWidget_C
// 0x0020 (0x0888 - 0x0868)
class UPlayerChoiceButtonWidget_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0868(0x0008)(Transient, DuplicateTransient)
	class ULegacyButtonIconText_C*                Button;                                            // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ChoiceID;                                          // 0x0878(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerChoiceWidget_C*                  Owner;                                             // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerChoiceButtonWidget(int32 EntryPoint);
	void BndEvt__Button_K2Node_ComponentBoundEvent_98_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button_0);
	void ConfigureChoice(const struct FChoiceDataEntry& Choice, int32 ChoiceID_0, class UPlayerChoiceWidget_C* Owner_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerChoiceButtonWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerChoiceButtonWidget_C")
	}
	static class UPlayerChoiceButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerChoiceButtonWidget_C>();
	}
};
DUMPER7_ASSERTS_UPlayerChoiceButtonWidget_C;

}

