#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerRequirement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PowerRequirement.PowerRequirement_C
// 0x0028 (0x0258 - 0x0230)
class UPowerRequirement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         PowerRequirementHB;                                // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyRatingWidget_C*                  RatingWidget;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RecommendedPower;                                  // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredPower;                                     // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PowerRequirement(int32 EntryPoint);
	void PlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId);
	void Construct();
	void SetRequirements(int32 RequiredPower_0, int32 RecommendedPower_0);
	void Update();
	void SetUIForRecommended(int32 PartyPower);
	void SetUIForRequired(int32 PartyPower);
	class UWidget* GenerateToolTipWidget();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PowerRequirement_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PowerRequirement_C")
	}
	static class UPowerRequirement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPowerRequirement_C>();
	}
};
DUMPER7_ASSERTS_UPowerRequirement_C;

}

