#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ProgressWidget.ProgressWidget_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct ProgressWidget_C_SetTitle final
{
public:
	class FText                                   Title_0;                                           // 0x0000(0x0018)(Parm)
};
DUMPER7_ASSERTS_ProgressWidget_C_SetTitle;

// Function ProgressWidget.ProgressWidget_C.SetDescription
// 0x0018 (0x0018 - 0x0000)
struct ProgressWidget_C_SetDescription final
{
public:
	class FText                                   Description_0;                                     // 0x0000(0x0018)(Parm)
};
DUMPER7_ASSERTS_ProgressWidget_C_SetDescription;

// Function ProgressWidget.ProgressWidget_C.SetIcon
// 0x0098 (0x0098 - 0x0000)
struct ProgressWidget_C_SetIcon final
{
public:
	struct FSlateBrush                            IconBrush;                                         // 0x0000(0x0090)(Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ProgressWidget_C_SetIcon;

}

