#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProtoCampaignMapPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProtoCampaignMapPage.ProtoCampaignMapPage_C
// 0x00F8 (0x0330 - 0x0238)
class UProtoCampaignMapPage_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageBackground;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Page;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         CurrentQuestItem;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Background_image;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   PageTitle;                                         // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UCanvasPanel*                           CachedQuestsCanvas;                                // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PowerValue;                                        // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            BackgroundBrush;                                   // 0x0298(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bDoNotCheckForMainQuest;                           // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ProtoCampaignMapPage(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void GetMainQuest(class UFortQuestItem** outCurentMainQuest);
	void CheckForMainQuest(bool* TargetQuestFound, int32* TargetQuestPageIndex);
	void SetBackgroundImage();
	void CheckForIncompleteQuest_Halloween_Event(bool* TargetQuestFound, int32* TargetQuestPageIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ProtoCampaignMapPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProtoCampaignMapPage_C")
	}
	static class UProtoCampaignMapPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProtoCampaignMapPage_C>();
	}
};
DUMPER7_ASSERTS_UProtoCampaignMapPage_C;

}

