#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialPickerItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RadialPickerItem.RadialPickerItem_C
// 0x0058 (0x0290 - 0x0238)
class URadialPickerItem_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BorderItemBorder;                                  // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageItemNotSelected;                              // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ImageOrItemSwitcher;                               // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 PickerItem;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextLabel;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PickerItemText;                                    // 0x0278(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_RadialPickerItem(int32 EntryPoint);
	void Construct();
	void SetImageAndLabelContent(const class FText& Text, const struct FSlateBrush& Brush, bool Option_Enabled, int32 RadialItemIndex);
	void SetSelected(bool IsSelected);
	void SetItemContent(class UFortItem* Item, bool Option_Enabled, int32 Radial_Item_Index);
	void SetShowImageAndLabel(bool ShowImageAndLabel);
	void SetKeybindVisibility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RadialPickerItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadialPickerItem_C")
	}
	static class URadialPickerItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadialPickerItem_C>();
	}
};
DUMPER7_ASSERTS_URadialPickerItem_C;

}

