#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardInfoButtonWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardInfoButtonWidget.RewardInfoButtonWidget_C
// 0x0048 (0x0908 - 0x08C0)
class URewardInfoButtonWidget_C final : public UFortRewardInfoButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         ItemDetails;                                       // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemInfo;                                          // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayNameText;                                   // 0x08D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DisplayQuantity;                                   // 0x08F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_RewardInfoButtonWidget(int32 EntryPoint);
	void HandleDifferentItemOrQuantitySetBP();
	void SetShowDescriptionBP(bool bInShowDescription);
	void GetDisplayName(class FText* DisplayName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RewardInfoButtonWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RewardInfoButtonWidget_C")
	}
	static class URewardInfoButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardInfoButtonWidget_C>();
	}
};
DUMPER7_ASSERTS_URewardInfoButtonWidget_C;

}

