#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreMessageNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScoreMessageNumber.ScoreMessageNumber_C
// 0x0030 (0x0268 - 0x0238)
class UScoreMessageNumber_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       ScoreValue;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnScoreValueSet;                                   // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EStatCategory                                 ScoreCategory;                                     // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ScoreMessageNumber(int32 EntryPoint);
	void Construct();
	void UpdateScoreText();
	void SetScore(int32 InScore);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ScoreMessageNumber_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScoreMessageNumber_C")
	}
	static class UScoreMessageNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreMessageNumber_C>();
	}
};
DUMPER7_ASSERTS_UScoreMessageNumber_C;

}

