#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreBarsScoreMessageItem

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScoreBarsScoreMessageItem.ScoreBarsScoreMessageItem_C
// 0x0048 (0x02C8 - 0x0280)
class UScoreBarsScoreMessageItem_C final : public UFortUIMessageItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       StackBump;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__Message_Size;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemStackCounter_C*                    ItemStackCounter;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Label;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Base_Delta;                                        // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScoreMessageNumber_C*                  ScoreValueWidget;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScoreBarsScoreMessageItem(int32 EntryPoint);
	void OnBeginRemove();
	void OnStackSizeChanged(int32 OldStackSize);
	void UpdateValues();
	void Setup(int32 Base_Delta_0, const class FText& Name_Text, class UScoreMessageNumber_C* In_Score_Widget);
	void GetScoreValueWidget(class UWidget** Widget);
	void ClearScoreValueWidget();
	void OnAppearAnimationFinished();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ScoreBarsScoreMessageItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScoreBarsScoreMessageItem_C")
	}
	static class UScoreBarsScoreMessageItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreBarsScoreMessageItem_C>();
	}
};
DUMPER7_ASSERTS_UScoreBarsScoreMessageItem_C;

}

