#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialDefaults

#include "Basic.hpp"

#include "SocialTypes_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class SocialDefaults.ChatColorSchemeDataAsset
// 0x0120 (0x0148 - 0x0028)
class UChatColorSchemeDataAsset final : public UDataAsset
{
public:
	struct FChatColorScheme                       ChatColorData;                                     // 0x0028(0x0120)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChatColorSchemeDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChatColorSchemeDataAsset")
	}
	static class UChatColorSchemeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatColorSchemeDataAsset>();
	}
};
DUMPER7_ASSERTS_UChatColorSchemeDataAsset;

// Class SocialDefaults.SocialActionButtonStyleDataAsset
// 0x02A8 (0x02D0 - 0x0028)
class USocialActionButtonStyleDataAsset final : public UDataAsset
{
public:
	struct FButtonStyle                           Style;                                             // 0x0028(0x02A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialActionButtonStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialActionButtonStyleDataAsset")
	}
	static class USocialActionButtonStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialActionButtonStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialActionButtonStyleDataAsset;

// Class SocialDefaults.SocialChatChromeColorSchemeDataAsset
// 0x0050 (0x0078 - 0x0028)
class USocialChatChromeColorSchemeDataAsset final : public UDataAsset
{
public:
	struct FChatChromeColorScheme                 Style;                                             // 0x0028(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatChromeColorSchemeDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatChromeColorSchemeDataAsset")
	}
	static class USocialChatChromeColorSchemeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeColorSchemeDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialChatChromeColorSchemeDataAsset;

// Class SocialDefaults.SocialChatChromeMarginsDataAsset
// 0x0068 (0x0090 - 0x0028)
class USocialChatChromeMarginsDataAsset final : public UDataAsset
{
public:
	struct FChatChromeMargins                     Style;                                             // 0x0028(0x0064)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatChromeMarginsDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatChromeMarginsDataAsset")
	}
	static class USocialChatChromeMarginsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeMarginsDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialChatChromeMarginsDataAsset;

// Class SocialDefaults.SocialChatChromeStyleDataAsset
// 0x0850 (0x0878 - 0x0028)
class USocialChatChromeStyleDataAsset final : public UDataAsset
{
public:
	struct FChatChromeStyle                       Style;                                             // 0x0028(0x0850)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatChromeStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatChromeStyleDataAsset")
	}
	static class USocialChatChromeStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialChatChromeStyleDataAsset;

// Class SocialDefaults.SocialChatMarkupStyleDataAsset
// 0x0670 (0x0698 - 0x0028)
class USocialChatMarkupStyleDataAsset final : public UDataAsset
{
public:
	struct FChatMarkupStyle                       Style;                                             // 0x0028(0x0670)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatMarkupStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatMarkupStyleDataAsset")
	}
	static class USocialChatMarkupStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMarkupStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialChatMarkupStyleDataAsset;

// Class SocialDefaults.SocialChatStyleDataAsset
// 0x1490 (0x14B8 - 0x0028)
class USocialChatStyleDataAsset final : public UDataAsset
{
public:
	struct FChatStyle                             Style;                                             // 0x0028(0x1490)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatStyleDataAsset")
	}
	static class USocialChatStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialChatStyleDataAsset;

// Class SocialDefaults.SocialCheckBoxStyleDataAsset
// 0x05E0 (0x0608 - 0x0028)
class USocialCheckBoxStyleDataAsset final : public UDataAsset
{
public:
	struct FCheckBoxStyle                         Style;                                             // 0x0028(0x05E0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialCheckBoxStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialCheckBoxStyleDataAsset")
	}
	static class USocialCheckBoxStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialCheckBoxStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialCheckBoxStyleDataAsset;

// Class SocialDefaults.SocialFontStyleDataAsset
// 0x02A0 (0x02C8 - 0x0028)
class USocialFontStyleDataAsset final : public UDataAsset
{
public:
	struct FSocialFontStyle                       Style;                                             // 0x0028(0x02A0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialFontStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialFontStyleDataAsset")
	}
	static class USocialFontStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFontStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialFontStyleDataAsset;

// Class SocialDefaults.SocialListMarginsDataAsset
// 0x0200 (0x0228 - 0x0028)
class USocialListMarginsDataAsset final : public UDataAsset
{
public:
	struct FSocialListMargins                     Style;                                             // 0x0028(0x0200)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialListMarginsDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialListMarginsDataAsset")
	}
	static class USocialListMarginsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListMarginsDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialListMarginsDataAsset;

// Class SocialDefaults.SocialListStyleDataAsset
// 0x2870 (0x2898 - 0x0028)
class USocialListStyleDataAsset final : public UDataAsset
{
public:
	struct FSocialListStyle                       Style;                                             // 0x0028(0x2870)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialListStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialListStyleDataAsset")
	}
	static class USocialListStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialListStyleDataAsset;

// Class SocialDefaults.SocialProfanityDataAsset
// 0x0010 (0x0038 - 0x0028)
class USocialProfanityDataAsset final : public UDataAsset
{
public:
	TArray<struct FProfanityData>                 ProfanityData;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialProfanityDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialProfanityDataAsset")
	}
	static class USocialProfanityDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialProfanityDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialProfanityDataAsset;

// Class SocialDefaults.SocialRadioBoxStyleDataAsset
// 0x05E0 (0x0608 - 0x0028)
class USocialRadioBoxStyleDataAsset final : public UDataAsset
{
public:
	struct FCheckBoxStyle                         Style;                                             // 0x0028(0x05E0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialRadioBoxStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialRadioBoxStyleDataAsset")
	}
	static class USocialRadioBoxStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialRadioBoxStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialRadioBoxStyleDataAsset;

// Class SocialDefaults.SocialScrollBarStyleDataAsset
// 0x0518 (0x0540 - 0x0028)
class USocialScrollBarStyleDataAsset final : public UDataAsset
{
public:
	struct FScrollBarStyle                        Style;                                             // 0x0028(0x0518)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialScrollBarStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialScrollBarStyleDataAsset")
	}
	static class USocialScrollBarStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialScrollBarStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialScrollBarStyleDataAsset;

// Class SocialDefaults.SocialSoundSchemaDataAsset
// 0x0048 (0x0070 - 0x0028)
class USocialSoundSchemaDataAsset final : public UDataAsset
{
public:
	struct FSocialSoundSchema                     SoundSchema;                                       // 0x0028(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialSoundSchemaDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialSoundSchemaDataAsset")
	}
	static class USocialSoundSchemaDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialSoundSchemaDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialSoundSchemaDataAsset;

// Class SocialDefaults.SocialStyleDataAsset
// 0x6E70 (0x6E98 - 0x0028)
class USocialStyleDataAsset final : public UDataAsset
{
public:
	class USocialFontStyleDataAsset*              SmallFontStyle;                                    // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              NormalFontStyle;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              LargeFontStyle;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              ChatFontStyle;                                     // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialListStyleDataAsset*              SocialListStyle;                                   // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialListMarginsDataAsset*            SocialListMargins;                                 // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatStyleDataAsset*              ChatStyle;                                         // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeStyleDataAsset*        ChatChromeStyle;                                   // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeMarginsDataAsset*      ChatChromeMargins;                                 // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeColorSchemeDataAsset*  ChatChromeColorScheme;                             // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatColorSchemeDataAsset*              ChatColorScheme;                                   // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialSoundSchemaDataAsset*            SoundSchema;                                       // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialActionButtonStyleDataAsset*      ActionButtonStyle;                                 // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialCheckBoxStyleDataAsset*          CheckBoxStyle;                                     // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialRadioBoxStyleDataAsset*          RadioBoxStyle;                                     // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialScrollBarStyleDataAsset*         ScrollBoxStyle;                                    // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatMarkupStyleDataAsset*        MarkupStyle;                                       // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialProfanityDataAsset*              ProfanityDataAsset;                                // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x6DE0];                                    // 0x00B8(0x6DE0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialStyleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialStyleDataAsset")
	}
	static class USocialStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialStyleDataAsset>();
	}
};
DUMPER7_ASSERTS_USocialStyleDataAsset;

}

