#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialTypes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct SocialTypes.ChatChromeColorScheme
// 0x0050 (0x0050 - 0x0000)
struct FChatChromeColorScheme final
{
public:
	struct FLinearColor                           ChatEntryBackgroundColor;                          // 0x0000(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NoneActiveTabColor;                                // 0x0010(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColor;                                      // 0x0020(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColorInverted;                              // 0x0030(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatBackgroundColor;                               // 0x0040(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChatChromeColorScheme;

// ScriptStruct SocialTypes.ChatChromeStyle
// 0x0850 (0x0850 - 0x0000)
struct FChatChromeStyle final
{
public:
	struct FSlateBrush                            UserListBrush;                                     // 0x0000(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatBackgroundBrush;                               // 0x0090(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatEntryBackgroundBrush;                          // 0x0120(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChannelBackgroundBrush;                            // 0x01B0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TabBackgroundBrush;                                // 0x0240(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           TabSelectorButtonStyle;                            // 0x02D0(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                TabOptionPadding;                                  // 0x0578(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabContentPadding;                                 // 0x0588(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabClosePadding;                                   // 0x0598(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FButtonStyle                           UserListButtonStyle;                               // 0x05A8(0x02A8)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChatChromeStyle;

// ScriptStruct SocialTypes.ChatChromeMargins
// 0x0064 (0x0064 - 0x0000)
struct FChatChromeMargins final
{
public:
	float                                         TabWidth;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TabPadding;                                        // 0x0004(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowPadding;                                 // 0x0014(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowToEntryMargin;                           // 0x0024(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatChannelPadding;                                // 0x0034(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListButtonPadding;                             // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListIconPadding;                               // 0x0054(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChatChromeMargins;

// ScriptStruct SocialTypes.ChatColorScheme
// 0x0120 (0x0120 - 0x0000)
struct FChatColorScheme final
{
public:
	struct FLinearColor                           TimeStampColor;                                    // 0x0000(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultChatColor;                                  // 0x0010(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperChatColor;                                  // 0x0020(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalChatColor;                                   // 0x0030(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderChatColor;                                  // 0x0040(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameChatColor;                                     // 0x0050(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamChatColor;                                     // 0x0060(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyChatColor;                                    // 0x0070(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AdminChatColor;                                    // 0x0080(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameAdminChatColor;                                // 0x0090(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperHyperlinkChatColor;                         // 0x00A0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalHyperlinkChatColor;                          // 0x00B0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderHyperlinkChatColor;                         // 0x00C0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameHyperlinkChatColor;                            // 0x00D0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamHyperlinkChatColor;                            // 0x00E0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyHyperlinkChatColor;                           // 0x00F0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EnemyColor;                                        // 0x0100(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FriendlyColor;                                     // 0x0110(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChatColorScheme;

// ScriptStruct SocialTypes.SocialListMargins
// 0x0200 (0x0200 - 0x0000)
struct FSocialListMargins final
{
public:
	struct FVector2D                              UserPresenceImageSize;                             // 0x0000(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonMargin;                                // 0x0008(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListMargin;                                 // 0x0018(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListNoFriendsMargin;                        // 0x0028(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderMargin;                           // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderCountMargin;                      // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonContentMargin;                         // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemMargin;                                  // 0x0068(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemStatusMargin;                            // 0x0078(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipStatusMargin;                             // 0x0088(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPresenceMargin;                          // 0x0098(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPlatformMargin;                          // 0x00A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemTextScrollerMargin;                      // 0x00B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationBorderMargin;                          // 0x00C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonMargin;                          // 0x00D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonContentMargin;                   // 0x00E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                NoneFriendContentMargin;                           // 0x00F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NoneFriendContentHeight;                           // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoneFriendIconWidth;                               // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackIconMargin;                             // 0x0110(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuPageIconMargin;                             // 0x0120(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                RadioSettingTitleMargin;                           // 0x0130(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchIconMargin;                           // 0x0140(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchTextMargin;                           // 0x0150(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackButtonMargin;                           // 0x0160(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSettingButtonMargin;                        // 0x0170(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuListMargin;                                 // 0x0180(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SubMenuSeperatorThickness;                         // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PresenceSeperatorThickness;                        // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipMargin;                                   // 0x0198(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipPresenceMargin;                           // 0x01A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipSeperatorMargin;                          // 0x01B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ToolTipMargin;                                     // 0x01C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TipStatusMargin;                                   // 0x01D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                AddButtonMargin;                                   // 0x01E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              AddButtonSpacing;                                  // 0x01F8(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSocialListMargins;

// ScriptStruct SocialTypes.ChatMarkupStyle
// 0x0670 (0x0670 - 0x0000)
struct FChatMarkupStyle final
{
public:
	struct FButtonStyle                           MarkupButtonStyle;                                 // 0x0000(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        MarkupTextStyle;                                   // 0x02A8(0x0208)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MarkupBackground;                                  // 0x04B0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonColor;                                       // 0x0540(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverColor;                                  // 0x0568(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            TipColor;                                          // 0x0590(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x05B8(0x0090)(Edit, NativeAccessSpecifierPublic)
	float                                         SeperatorThickness;                                // 0x0648(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                MarkupPadding;                                     // 0x064C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ButtonPadding;                                     // 0x065C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChatMarkupStyle;

// ScriptStruct SocialTypes.ChatStyle
// 0x1490 (0x1490 - 0x0000)
struct FChatStyle final
{
public:
	struct FEditableTextBoxStyle                  ChatEntryTextStyle;                                // 0x0000(0x0870)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatDisplayTextStyle;                              // 0x0870(0x0870)(Edit, NativeAccessSpecifierPublic)
	struct FScrollBoxStyle                        ScrollBorderStyle;                                 // 0x10E0(0x0248)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MessageNotificationBrush;                          // 0x1328(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x13B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ChatEntryHeight;                                   // 0x13C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13CC[0x4];                                     // 0x13CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ChatMenuBackgroundBrush;                           // 0x13D0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionPadding;                               // 0x1460(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionHeaderPadding;                         // 0x1470(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionStatusMargin;                          // 0x1480(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChatStyle;

// ScriptStruct SocialTypes.SocialFontStyle
// 0x02A0 (0x02A0 - 0x0000)
struct FSocialFontStyle final
{
public:
	struct FSlateFontInfo                         FontSmall;                                         // 0x0000(0x0068)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontSmallBold;                                     // 0x0068(0x0068)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormal;                                        // 0x00D0(0x0068)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormalBold;                                    // 0x0138(0x0068)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLarge;                                         // 0x01A0(0x0068)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLargeBold;                                     // 0x0208(0x0068)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultFontColor;                                  // 0x0270(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InvertedFontColor;                                 // 0x0280(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultDullFontColor;                              // 0x0290(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSocialFontStyle;

// ScriptStruct SocialTypes.SocialListStyle
// 0x2870 (0x2870 - 0x0000)
struct FSocialListStyle final
{
public:
	struct FButtonStyle                           GlobalChatButtonStyle;                             // 0x0000(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GlobalChatIcon;                                    // 0x02A8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendItemButtonStyle;                             // 0x0338(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ConfirmButtonStyle;                                // 0x05E0(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           CancelButtonStyle;                                 // 0x0888(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonContentColor;                                // 0x0B30(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverContentColor;                           // 0x0B58(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowBrush;                              // 0x0B80(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowRightBrush;                         // 0x0C10(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ActionMenuBackgroundColor;                         // 0x0CA0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ToolTipArrowBrush;                                 // 0x0CC8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           BackButtonStyle;                                   // 0x0D58(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           HeaderButtonStyle;                                 // 0x1000(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendListActionButtonStyle;                       // 0x12A8(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AddFriendButtonContentBrush;                       // 0x1550(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StatusIconBrush;                                   // 0x15E0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PCIconBrush;                                       // 0x1670(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ConsoleIconBrush;                                  // 0x1700(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EpicIconBrush;                                     // 0x1790(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendImageBrush;                                  // 0x1820(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OfflineBrush;                                      // 0x18B0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OnlineBrush;                                       // 0x1940(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AwayBrush;                                         // 0x19D0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SpectateBrush;                                     // 0x1A60(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsContainerBackground;                        // 0x1AF0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsListBackground;                             // 0x1B80(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  AddFriendEditableTextStyle;                        // 0x1C10(0x0870)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackBrush;                                         // 0x2480(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SelectedOptionBrush;                               // 0x2510(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SettingsBrush;                                     // 0x25A0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x2630(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PresenceSeperatorBrush;                            // 0x26C0(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FontSizeBrush;                                     // 0x2750(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SearchBrush;                                       // 0x27E0(0x0090)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSocialListStyle;

// ScriptStruct SocialTypes.ProfanityData
// 0x0038 (0x0038 - 0x0000)
struct FProfanityData final
{
public:
	class FString                                 CountryCode;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfanityList;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WhiteList;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAdd;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProfanityData;

// ScriptStruct SocialTypes.SocialSoundSchema
// 0x0048 (0x0048 - 0x0000)
struct FSocialSoundSchema final
{
public:
	struct FSlateSound                            MessageReceivedSound;                              // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            PartyInviteReceivedSound;                          // 0x0018(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            FriendInviteReceivedSound;                         // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSocialSoundSchema;

// ScriptStruct SocialTypes.SocialStyle
// 0x6DE0 (0x6DE0 - 0x0000)
struct FSocialStyle final
{
public:
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0000(0x0518)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ActionButtonStyle;                                 // 0x0518(0x02A8)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       SmallFontStyle;                                    // 0x07C0(0x02A0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       NormalFontStyle;                                   // 0x0A60(0x02A0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       LargeFontStyle;                                    // 0x0D00(0x02A0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       ChatFontStyle;                                     // 0x0FA0(0x02A0)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         CheckBoxStyle;                                     // 0x1240(0x05E0)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         RadioBoxStyle;                                     // 0x1820(0x05E0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListStyle                       SocialListStyle;                                   // 0x1E00(0x2870)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListMargins                     SocialListMargins;                                 // 0x4670(0x0200)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatStyle                             ChatStyle;                                         // 0x4870(0x1490)(Edit, NativeAccessSpecifierPublic)
	struct FChatColorScheme                       ChatColorScheme;                                   // 0x5D00(0x0120)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeStyle                       ChatChromeStyle;                                   // 0x5E20(0x0850)(Edit, NativeAccessSpecifierPublic)
	struct FChatChromeMargins                     ChatChromeMargins;                                 // 0x6670(0x0064)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeColorScheme                 ChatChromeColorScheme;                             // 0x66D4(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6724[0x4];                                     // 0x6724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatMarkupStyle                       ChatMarkupStyle;                                   // 0x6728(0x0670)(Edit, NativeAccessSpecifierPublic)
	struct FSocialSoundSchema                     SoundSchema;                                       // 0x6D98(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSocialStyle;

}

