#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGamePadConfig

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabGamePadConfig.TabGamePadConfig_C
// 0x0048 (0x02D0 - 0x0288)
class UTabGamePadConfig_C final : public UFortGameOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(Transient, DuplicateTransient)
	class URotatorSelector_C*                     ControllerPlatformConfig;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     GamepadConfig;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadMappingInfo_C*                  GamepadMappingInfo;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxControllerPlatform;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCombatMode;                                      // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         InputPresets;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         ControllerPlatformMappingIndex;                    // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ControllerConfiguration;                           // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TabGamePadConfig(int32 EntryPoint);
	void ControllerPlatformConfigChanged(int32 Selected_Index);
	void UpdateOptionsTab();
	void Gamepad_Config_Changed(int32 Selected_Index);
	void CenterOnTab();
	void Configuration_Changed(int32 Selected_Index);
	void Construct();
	void Initialize_Data();
	void Update_Data();
	void Handle_Mode_Toggled();
	void HandleGamepadMappingInfoChange();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TabGamePadConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TabGamePadConfig_C")
	}
	static class UTabGamePadConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabGamePadConfig_C>();
	}
};
DUMPER7_ASSERTS_UTabGamePadConfig_C;

}

