#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipDurabilityMeter

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TooltipDurabilityMeter.TooltipDurabilityMeter_C
// 0x0098 (0x02C8 - 0x0230)
class UTooltipDurabilityMeter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           _Vertical_Box__Durability;                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDurabilityMeter_C*                 ItemDurabilityMeter;                               // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTooltip_DisplayAttribute_C*            Tooltip_DisplayAttribute;                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  DisplayData;                                       // 0x0250(0x0070)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         Normalized;                                        // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TooltipDurabilityMeter(int32 EntryPoint);
	void Construct();
	void Draw(float Normalized_0, const struct FFortDisplayAttribute& Display_Attribute);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TooltipDurabilityMeter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TooltipDurabilityMeter_C")
	}
	static class UTooltipDurabilityMeter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipDurabilityMeter_C>();
	}
};
DUMPER7_ASSERTS_UTooltipDurabilityMeter_C;

}

