#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tooltip_CoreStat

#include "Basic.hpp"

#include "HeroCoreStat_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-CoreStat.Tooltip-CoreStat_C
// 0x03E8 (0x0618 - 0x0230)
class UTooltip_CoreStat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageStatIcon;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageStatShadow;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextStatDesc;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextStatLabel;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextStatValue;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FHeroCoreStat                          Data;                                              // 0x0260(0x03B0)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tooltip_CoreStat(int32 EntryPoint);
	void Construct();
	void Update(const struct FHeroCoreStat& Data_0, float Value_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Tooltip-CoreStat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Tooltip-CoreStat_C")
	}
	static class UTooltip_CoreStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltip_CoreStat_C>();
	}
};
DUMPER7_ASSERTS_UTooltip_CoreStat_C;

}

