#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipStatWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TooltipStat_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TooltipStatWrapper.TooltipStatWrapper_C
// 0x0078 (0x02A8 - 0x0230)
class UTooltipStatWrapper_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         Container_HBox;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PreviewHighlight_Image;                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTooltipStatWidget_C*                   Stat_Widget;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Upgrade_Border;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upgrade_Image;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowAsPreview;                                     // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTooltipStat                           inTooltipData;                                     // 0x0268(0x0038)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          inHoverEnabled;                                    // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_TooltipStatWrapper(int32 EntryPoint);
	void Construct();
	void ShowUpgradeArrow(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TooltipStatWrapper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TooltipStatWrapper_C")
	}
	static class UTooltipStatWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipStatWrapper_C>();
	}
};
DUMPER7_ASSERTS_UTooltipStatWrapper_C;

}

