#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipStatWrapper

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TooltipStatWrapper.TooltipStatWrapper_C.ExecuteUbergraph_TooltipStatWrapper
// 0x0008 (0x0008 - 0x0000)
struct TooltipStatWrapper_C_ExecuteUbergraph_TooltipStatWrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TooltipStatWrapper_C_ExecuteUbergraph_TooltipStatWrapper;

// Function TooltipStatWrapper.TooltipStatWrapper_C.ShowUpgradeArrow
// 0x0001 (0x0001 - 0x0000)
struct TooltipStatWrapper_C_ShowUpgradeArrow final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TooltipStatWrapper_C_ShowUpgradeArrow;

}

