#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkerTooltipStatsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C
// 0x0028 (0x0258 - 0x0230)
class UWorkerTooltipStatsWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             BuildingSynergyTextBlock;                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PersonalityTextBlock;                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SetBonusTextBlock;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortWorker*                            Worker_Item;                                       // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WorkerTooltipStatsWidget(int32 EntryPoint);
	void On_Worker_Preview_State_Changed();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WorkerTooltipStatsWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorkerTooltipStatsWidget_C")
	}
	static class UWorkerTooltipStatsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorkerTooltipStatsWidget_C>();
	}
};
DUMPER7_ASSERTS_UWorkerTooltipStatsWidget_C;

}

